areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
/*
* @file    p33c_pin_intrinsics.h
* @author  M91406
* @brief   Pin properties access function intrinsics header file
* @version 1.0.7
* @date    10/27/23
*/
// This is a guard condition so that contents of this file are not included
// more than once.
#ifndef P33C_PIN_INTRINSICS_H
#define P33C_PIN_INTRINSICS_H

#include <xc.h> // include processor files - each processor file is guarded.
#include "../exth/p33c_devices.h" // include dsPIC33C SMPS device families identification macros header file

// Function declarations of port pin RA0
#if defined (_TRISA0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA0_Get(void)          { return((bool)_RA0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_Set(void)          { asm volatile ("bset _LATA, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_Clear(void)        { asm volatile ("bclr _LATA, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_Toggle(void)       { asm volatile ("btg _LATA, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetInput(void)     { asm volatile ("bset _TRISA, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetOutput(void)    { asm volatile ("bclr _TRISA, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetState(const bool s)   { _LATA0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_Init(const bool d, const bool s) { _LATA0 = s; _TRISA0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_Dispose(void)      { _TRISA0 = 1; _LATA0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA0_GetOpenDrain(void) { return(_ODCA0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetOpenDrain(const bool a) { _ODCA0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA0_GetPullUp(void)    { return(_CNPUA0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetPullUp(const bool a)  { _CNPUA0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA0_GetPullDown(void)  { return(_CNPUA0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetPullDown(const bool a) { _CNPUA0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetAnalog(void)    { _ANSELA0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetDigital(void)   { _ANSELA0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA0

// Function declarations of port pin RA1
#if defined (_TRISA1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA1_Get(void)          { return((bool)_RA1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_Set(void)          { asm volatile ("bset _LATA, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_Clear(void)        { asm volatile ("bclr _LATA, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_Toggle(void)       { asm volatile ("btg _LATA, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetInput(void)     { asm volatile ("bset _TRISA, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetOutput(void)    { asm volatile ("bclr _TRISA, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetState(const bool s)   { _LATA1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_Init(const bool d, const bool s) { _LATA1 = s; _TRISA1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_Dispose(void)      { _TRISA1 = 1; _LATA1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA1_GetOpenDrain(void) { return(_ODCA1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetOpenDrain(const bool a) { _ODCA1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA1_GetPullUp(void)    { return(_CNPUA1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetPullUp(const bool a)  { _CNPUA1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA1_GetPullDown(void)  { return(_CNPUA1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetPullDown(const bool a) { _CNPUA1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetAnalog(void)    { _ANSELA1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetDigital(void)   { _ANSELA1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

