areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RA1

// Function declarations of port pin RA2
#if defined (_TRISA2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA2_Get(void)          { return((bool)_RA2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_Set(void)          { asm volatile ("bset _LATA, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_Clear(void)        { asm volatile ("bclr _LATA, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_Toggle(void)       { asm volatile ("btg _LATA, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetInput(void)     { asm volatile ("bset _TRISA, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetOutput(void)    { asm volatile ("bclr _TRISA, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetState(const bool s)   { _LATA2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_Init(const bool d, const bool s) { _LATA2 = s; _TRISA2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_Dispose(void)      { _TRISA2 = 1; _LATA2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA2_GetOpenDrain(void) { return(_ODCA2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetOpenDrain(const bool a) { _ODCA2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA2_GetPullUp(void)    { return(_CNPUA2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetPullUp(const bool a)  { _CNPUA2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA2_GetPullDown(void)  { return(_CNPUA2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetPullDown(const bool a) { _CNPUA2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetAnalog(void)    { _ANSELA2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetDigital(void)   { _ANSELA2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA2

// Function declarations of port pin RA3
#if defined (_TRISA3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA3_Get(void)          { return((bool)_RA3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_Set(void)          { asm volatile ("bset _LATA, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_Clear(void)        { asm volatile ("bclr _LATA, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_Toggle(void)       { asm volatile ("btg _LATA, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetInput(void)     { asm volatile ("bset _TRISA, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetOutput(void)    { asm volatile ("bclr _TRISA, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetState(const bool s)   { _LATA3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_Init(const bool d, const bool s) { _LATA3 = s; _TRISA3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_Dispose(void)      { _TRISA3 = 1; _LATA3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA3_GetOpenDrain(void) { return(_ODCA3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetOpenDrain(const bool a) { _ODCA3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA3_GetPullUp(void)    { return(_CNPUA3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetPullUp(const bool a)  { _CNPUA3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA3_GetPullDown(void)  { return(_CNPUA3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetPullDown(const bool a) { _CNPUA3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetAnalog(void)    { _ANSELA3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetDigital(void)   { _ANSELA3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

