areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RA3

// Function declarations of port pin RA4
#if defined (_TRISA4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA4_Get(void)          { return((bool)_RA4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_Set(void)          { asm volatile ("bset _LATA, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_Clear(void)        { asm volatile ("bclr _LATA, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_Toggle(void)       { asm volatile ("btg _LATA, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetInput(void)     { asm volatile ("bset _TRISA, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetOutput(void)    { asm volatile ("bclr _TRISA, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetState(const bool s)   { _LATA4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_Init(const bool d, const bool s) { _LATA4 = s; _TRISA4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_Dispose(void)      { _TRISA4 = 1; _LATA4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA4_GetOpenDrain(void) { return(_ODCA4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetOpenDrain(const bool a) { _ODCA4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA4_GetPullUp(void)    { return(_CNPUA4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetPullUp(const bool a)  { _CNPUA4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA4_GetPullDown(void)  { return(_CNPUA4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetPullDown(const bool a) { _CNPUA4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetAnalog(void)    { _ANSELA4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetDigital(void)   { _ANSELA4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA4

// Function declarations of port pin RA5
#if defined (_TRISA5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA5_Get(void)          { return((bool)_RA5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_Set(void)          { asm volatile ("bset _LATA, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_Clear(void)        { asm volatile ("bclr _LATA, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_Toggle(void)       { asm volatile ("btg _LATA, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetInput(void)     { asm volatile ("bset _TRISA, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetOutput(void)    { asm volatile ("bclr _TRISA, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetState(const bool s)   { _LATA5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_Init(const bool d, const bool s) { _LATA5 = s; _TRISA5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_Dispose(void)      { _TRISA5 = 1; _LATA5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA5_GetOpenDrain(void) { return(_ODCA5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetOpenDrain(const bool a) { _ODCA5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA5_GetPullUp(void)    { return(_CNPUA5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetPullUp(const bool a)  { _CNPUA5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA5_GetPullDown(void)  { return(_CNPUA5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetPullDown(const bool a) { _CNPUA5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetAnalog(void)    { _ANSELA5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetDigital(void)   { _ANSELA5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA5

// Function declarations of port pin RA6
#if defined (_TRISA6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA6_Get(void)          { return((bool)_RA6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_Set(void)          { asm volatile ("bset _LATA, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_Clear(void)        { asm volatile ("bclr _LATA, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_Toggle(void)       { asm volatile ("btg _LATA, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetInput(void)     { asm volatile ("bset _TRISA, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetOutput(void)    { asm volatile ("bclr _TRISA, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetState(const bool s)   { _LATA6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_Init(const bool d, const bool s) { _LATA6 = s; _TRISA6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_Dispose(void)      { _TRISA6 = 1; _LATA6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA6_GetOpenDrain(void) { return(_ODCA6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetOpenDrain(const bool a) { _ODCA6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA6_GetPullUp(void)    { return(_CNPUA6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetPullUp(const bool a)  { _CNPUA6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA6_GetPullDown(void)  { return(_CNPUA6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetPullDown(const bool a) { _CNPUA6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetAnalog(void)    { _ANSELA6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetDigital(void)   { _ANSELA6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA6

