areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RA7
#if defined (_TRISA7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA7_Get(void)          { return((bool)_RA7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_Set(void)          { asm volatile ("bset _LATA, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_Clear(void)        { asm volatile ("bclr _LATA, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_Toggle(void)       { asm volatile ("btg _LATA, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetInput(void)     { asm volatile ("bset _TRISA, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetOutput(void)    { asm volatile ("bclr _TRISA, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetState(const bool s)   { _LATA7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_Init(const bool d, const bool s) { _LATA7 = s; _TRISA7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_Dispose(void)      { _TRISA7 = 1; _LATA7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA7_GetOpenDrain(void) { return(_ODCA7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetOpenDrain(const bool a) { _ODCA7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA7_GetPullUp(void)    { return(_CNPUA7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetPullUp(const bool a)  { _CNPUA7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA7_GetPullDown(void)  { return(_CNPUA7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetPullDown(const bool a) { _CNPUA7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetAnalog(void)    { _ANSELA7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetDigital(void)   { _ANSELA7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA7

// Function declarations of port pin RA8
#if defined (_TRISA8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA8_Get(void)          { return((bool)_RA8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_Set(void)          { asm volatile ("bset _LATA, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_Clear(void)        { asm volatile ("bclr _LATA, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_Toggle(void)       { asm volatile ("btg _LATA, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetInput(void)     { asm volatile ("bset _TRISA, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetOutput(void)    { asm volatile ("bclr _TRISA, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetState(const bool s)   { _LATA8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_Init(const bool d, const bool s) { _LATA8 = s; _TRISA8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_Dispose(void)      { _TRISA8 = 1; _LATA8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA8_GetOpenDrain(void) { return(_ODCA8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetOpenDrain(const bool a) { _ODCA8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA8_GetPullUp(void)    { return(_CNPUA8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetPullUp(const bool a)  { _CNPUA8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA8_GetPullDown(void)  { return(_CNPUA8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetPullDown(const bool a) { _CNPUA8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetAnalog(void)    { _ANSELA8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetDigital(void)   { _ANSELA8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

