areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RA8

// Function declarations of port pin RA9
#if defined (_TRISA9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA9_Get(void)          { return((bool)_RA9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_Set(void)          { asm volatile ("bset _LATA, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_Clear(void)        { asm volatile ("bclr _LATA, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_Toggle(void)       { asm volatile ("btg _LATA, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetInput(void)     { asm volatile ("bset _TRISA, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetOutput(void)    { asm volatile ("bclr _TRISA, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetState(const bool s)   { _LATA9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_Init(const bool d, const bool s) { _LATA9 = s; _TRISA9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_Dispose(void)      { _TRISA9 = 1; _LATA9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA9_GetOpenDrain(void) { return(_ODCA9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetOpenDrain(const bool a) { _ODCA9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA9_GetPullUp(void)    { return(_CNPUA9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetPullUp(const bool a)  { _CNPUA9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA9_GetPullDown(void)  { return(_CNPUA9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetPullDown(const bool a) { _CNPUA9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetAnalog(void)    { _ANSELA9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetDigital(void)   { _ANSELA9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA9

// Function declarations of port pin RA10
#if defined (_TRISA10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA10_Get(void)         { return((bool)_RA10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_Set(void)         { asm volatile ("bset _LATA, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_Clear(void)       { asm volatile ("bclr _LATA, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_Toggle(void)      { asm volatile ("btg _LATA, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetInput(void)    { asm volatile ("bset _TRISA, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetOutput(void)   { asm volatile ("bclr _TRISA, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetState(const bool s)  { _LATA10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_Init(const bool d, const bool s) { _LATA10 = s; _TRISA10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_Dispose(void)     { _TRISA10 = 1; _LATA10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA10_GetOpenDrain(void) { return(_ODCA10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetOpenDrain(const bool a) { _ODCA10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA10_GetPullUp(void)   { return(_CNPUA10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetPullUp(const bool a) { _CNPUA10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA10_GetPullDown(void) { return(_CNPUA10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetPullDown(const bool a) { _CNPUA10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetAnalog(void)   { _ANSELA10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetDigital(void)  { _ANSELA10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

