areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RA10

// Function declarations of port pin RA11
#if defined (_TRISA11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA11_Get(void)         { return((bool)_RA11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_Set(void)         { asm volatile ("bset _LATA, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_Clear(void)       { asm volatile ("bclr _LATA, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_Toggle(void)      { asm volatile ("btg _LATA, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetInput(void)    { asm volatile ("bset _TRISA, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetOutput(void)   { asm volatile ("bclr _TRISA, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetState(const bool s)  { _LATA11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_Init(const bool d, const bool s) { _LATA11 = s; _TRISA11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_Dispose(void)     { _TRISA11 = 1; _LATA11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA11_GetOpenDrain(void) { return(_ODCA11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetOpenDrain(const bool a) { _ODCA11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA11_GetPullUp(void)   { return(_CNPUA11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetPullUp(const bool a) { _CNPUA11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA11_GetPullDown(void) { return(_CNPUA11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetPullDown(const bool a) { _CNPUA11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetAnalog(void)   { _ANSELA11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetDigital(void)  { _ANSELA11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA11

// Function declarations of port pin RA12
#if defined (_TRISA12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA12_Get(void)         { return((bool)_RA12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_Set(void)         { asm volatile ("bset _LATA, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_Clear(void)       { asm volatile ("bclr _LATA, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_Toggle(void)      { asm volatile ("btg _LATA, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetInput(void)    { asm volatile ("bset _TRISA, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetOutput(void)   { asm volatile ("bclr _TRISA, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetState(const bool s)  { _LATA12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_Init(const bool d, const bool s) { _LATA12 = s; _TRISA12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_Dispose(void)     { _TRISA12 = 1; _LATA12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA12_GetOpenDrain(void) { return(_ODCA12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetOpenDrain(const bool a) { _ODCA12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA12_GetPullUp(void)   { return(_CNPUA12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetPullUp(const bool a) { _CNPUA12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA12_GetPullDown(void) { return(_CNPUA12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetPullDown(const bool a) { _CNPUA12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetAnalog(void)   { _ANSELA12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetDigital(void)  { _ANSELA12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

