areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RA12

// Function declarations of port pin RA13
#if defined (_TRISA13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA13_Get(void)         { return((bool)_RA13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_Set(void)         { asm volatile ("bset _LATA, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_Clear(void)       { asm volatile ("bclr _LATA, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_Toggle(void)      { asm volatile ("btg _LATA, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetInput(void)    { asm volatile ("bset _TRISA, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetOutput(void)   { asm volatile ("bclr _TRISA, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetState(const bool s)  { _LATA13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_Init(const bool d, const bool s) { _LATA13 = s; _TRISA13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_Dispose(void)     { _TRISA13 = 1; _LATA13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA13_GetOpenDrain(void) { return(_ODCA13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetOpenDrain(const bool a) { _ODCA13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA13_GetPullUp(void)   { return(_CNPUA13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetPullUp(const bool a) { _CNPUA13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA13_GetPullDown(void) { return(_CNPUA13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetPullDown(const bool a) { _CNPUA13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetAnalog(void)   { _ANSELA13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetDigital(void)  { _ANSELA13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA13

// Function declarations of port pin RA14
#if defined (_TRISA14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA14_Get(void)         { return((bool)_RA14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_Set(void)         { asm volatile ("bset _LATA, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_Clear(void)       { asm volatile ("bclr _LATA, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_Toggle(void)      { asm volatile ("btg _LATA, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetInput(void)    { asm volatile ("bset _TRISA, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetOutput(void)   { asm volatile ("bclr _TRISA, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetState(const bool s)  { _LATA14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_Init(const bool d, const bool s) { _LATA14 = s; _TRISA14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_Dispose(void)     { _TRISA14 = 1; _LATA14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA14_GetOpenDrain(void) { return(_ODCA14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetOpenDrain(const bool a) { _ODCA14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA14_GetPullUp(void)   { return(_CNPUA14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetPullUp(const bool a) { _CNPUA14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA14_GetPullDown(void) { return(_CNPUA14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetPullDown(const bool a) { _CNPUA14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetAnalog(void)   { _ANSELA14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetDigital(void)  { _ANSELA14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA14

