areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RA15
#if defined (_TRISA15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA15_Get(void)         { return((bool)_RA15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_Set(void)         { asm volatile ("bset _LATA, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_Clear(void)       { asm volatile ("bclr _LATA, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_Toggle(void)      { asm volatile ("btg _LATA, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetInput(void)    { asm volatile ("bset _TRISA, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetOutput(void)   { asm volatile ("bclr _TRISA, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetState(const bool s)  { _LATA15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_Init(const bool d, const bool s) { _LATA15 = s; _TRISA15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_Dispose(void)     { _TRISA15 = 1; _LATA15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA15_GetOpenDrain(void) { return(_ODCA15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetOpenDrain(const bool a) { _ODCA15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA15_GetPullUp(void)   { return(_CNPUA15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetPullUp(const bool a) { _CNPUA15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RA15_GetPullDown(void) { return(_CNPUA15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetPullDown(const bool a) { _CNPUA15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELA15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetAnalog(void)   { _ANSELA15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELA15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetDigital(void)  { _ANSELA15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RA15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RA15

// Function declarations of port pin RB0
#if defined (_TRISB0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB0_Get(void)          { return((bool)_RB0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_Set(void)          { asm volatile ("bset _LATB, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_Clear(void)        { asm volatile ("bclr _LATB, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_Toggle(void)       { asm volatile ("btg _LATB, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetInput(void)     { asm volatile ("bset _TRISB, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetOutput(void)    { asm volatile ("bclr _TRISB, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetState(const bool s)   { _LATB0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_Init(const bool d, const bool s) { _LATB0 = s; _TRISB0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_Dispose(void)      { _TRISB0 = 1; _LATB0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB0_GetOpenDrain(void) { return(_ODCB0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetOpenDrain(const bool a) { _ODCB0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB0_GetPullUp(void)    { return(_CNPUB0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetPullUp(const bool a)  { _CNPUB0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB0_GetPullDown(void)  { return(_CNPUB0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetPullDown(const bool a) { _CNPUB0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetAnalog(void)    { _ANSELB0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetDigital(void)   { _ANSELB0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB0

// Function declarations of port pin RB1
#if defined (_TRISB1)

