areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB1_Get(void)          { return((bool)_RB1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_Set(void)          { asm volatile ("bset _LATB, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_Clear(void)        { asm volatile ("bclr _LATB, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_Toggle(void)       { asm volatile ("btg _LATB, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetInput(void)     { asm volatile ("bset _TRISB, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetOutput(void)    { asm volatile ("bclr _TRISB, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetState(const bool s)   { _LATB1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_Init(const bool d, const bool s) { _LATB1 = s; _TRISB1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_Dispose(void)      { _TRISB1 = 1; _LATB1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB1_GetOpenDrain(void) { return(_ODCB1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetOpenDrain(const bool a) { _ODCB1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB1_GetPullUp(void)    { return(_CNPUB1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetPullUp(const bool a)  { _CNPUB1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB1_GetPullDown(void)  { return(_CNPUB1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetPullDown(const bool a) { _CNPUB1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetAnalog(void)    { _ANSELB1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetDigital(void)   { _ANSELB1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB1

// Function declarations of port pin RB2
#if defined (_TRISB2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB2_Get(void)          { return((bool)_RB2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_Set(void)          { asm volatile ("bset _LATB, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_Clear(void)        { asm volatile ("bclr _LATB, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_Toggle(void)       { asm volatile ("btg _LATB, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetInput(void)     { asm volatile ("bset _TRISB, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetOutput(void)    { asm volatile ("bclr _TRISB, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetState(const bool s)   { _LATB2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_Init(const bool d, const bool s) { _LATB2 = s; _TRISB2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_Dispose(void)      { _TRISB2 = 1; _LATB2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB2_GetOpenDrain(void) { return(_ODCB2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetOpenDrain(const bool a) { _ODCB2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB2_GetPullUp(void)    { return(_CNPUB2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetPullUp(const bool a)  { _CNPUB2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB2_GetPullDown(void)  { return(_CNPUB2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetPullDown(const bool a) { _CNPUB2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetAnalog(void)    { _ANSELB2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetDigital(void)   { _ANSELB2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB2

// Function declarations of port pin RB3
#if defined (_TRISB3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB3_Get(void)          { return((bool)_RB3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_Set(void)          { asm volatile ("bset _LATB, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_Clear(void)        { asm volatile ("bclr _LATB, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_Toggle(void)       { asm volatile ("btg _LATB, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetInput(void)     { asm volatile ("bset _TRISB, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetOutput(void)    { asm volatile ("bclr _TRISB, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetState(const bool s)   { _LATB3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_Init(const bool d, const bool s) { _LATB3 = s; _TRISB3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_Dispose(void)      { _TRISB3 = 1; _LATB3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB3_GetOpenDrain(void) { return(_ODCB3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetOpenDrain(const bool a) { _ODCB3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB3_GetPullUp(void)    { return(_CNPUB3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetPullUp(const bool a)  { _CNPUB3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB3_GetPullDown(void)  { return(_CNPUB3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetPullDown(const bool a) { _CNPUB3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetAnalog(void)    { _ANSELB3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetDigital(void)   { _ANSELB3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB3

// Function declarations of port pin RB4
#if defined (_TRISB4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB4_Get(void)          { return((bool)_RB4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_Set(void)          { asm volatile ("bset _LATB, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_Clear(void)        { asm volatile ("bclr _LATB, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_Toggle(void)       { asm volatile ("btg _LATB, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetInput(void)     { asm volatile ("bset _TRISB, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetOutput(void)    { asm volatile ("bclr _TRISB, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetState(const bool s)   { _LATB4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_Init(const bool d, const bool s) { _LATB4 = s; _TRISB4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_Dispose(void)      { _TRISB4 = 1; _LATB4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB4_GetOpenDrain(void) { return(_ODCB4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetOpenDrain(const bool a) { _ODCB4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB4_GetPullUp(void)    { return(_CNPUB4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetPullUp(const bool a)  { _CNPUB4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB4_GetPullDown(void)  { return(_CNPUB4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetPullDown(const bool a) { _CNPUB4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetAnalog(void)    { _ANSELB4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetDigital(void)   { _ANSELB4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

