areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RB4

// Function declarations of port pin RB5
#if defined (_TRISB5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB5_Get(void)          { return((bool)_RB5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_Set(void)          { asm volatile ("bset _LATB, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_Clear(void)        { asm volatile ("bclr _LATB, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_Toggle(void)       { asm volatile ("btg _LATB, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetInput(void)     { asm volatile ("bset _TRISB, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetOutput(void)    { asm volatile ("bclr _TRISB, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetState(const bool s)   { _LATB5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_Init(const bool d, const bool s) { _LATB5 = s; _TRISB5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_Dispose(void)      { _TRISB5 = 1; _LATB5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB5_GetOpenDrain(void) { return(_ODCB5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetOpenDrain(const bool a) { _ODCB5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB5_GetPullUp(void)    { return(_CNPUB5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetPullUp(const bool a)  { _CNPUB5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB5_GetPullDown(void)  { return(_CNPUB5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetPullDown(const bool a) { _CNPUB5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetAnalog(void)    { _ANSELB5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetDigital(void)   { _ANSELB5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB5

// Function declarations of port pin RB6
#if defined (_TRISB6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB6_Get(void)          { return((bool)_RB6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_Set(void)          { asm volatile ("bset _LATB, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_Clear(void)        { asm volatile ("bclr _LATB, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_Toggle(void)       { asm volatile ("btg _LATB, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetInput(void)     { asm volatile ("bset _TRISB, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetOutput(void)    { asm volatile ("bclr _TRISB, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetState(const bool s)   { _LATB6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_Init(const bool d, const bool s) { _LATB6 = s; _TRISB6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_Dispose(void)      { _TRISB6 = 1; _LATB6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB6_GetOpenDrain(void) { return(_ODCB6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetOpenDrain(const bool a) { _ODCB6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB6_GetPullUp(void)    { return(_CNPUB6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetPullUp(const bool a)  { _CNPUB6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB6_GetPullDown(void)  { return(_CNPUB6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetPullDown(const bool a) { _CNPUB6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetAnalog(void)    { _ANSELB6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetDigital(void)   { _ANSELB6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

