areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RB6

// Function declarations of port pin RB7
#if defined (_TRISB7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB7_Get(void)          { return((bool)_RB7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_Set(void)          { asm volatile ("bset _LATB, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_Clear(void)        { asm volatile ("bclr _LATB, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_Toggle(void)       { asm volatile ("btg _LATB, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetInput(void)     { asm volatile ("bset _TRISB, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetOutput(void)    { asm volatile ("bclr _TRISB, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetState(const bool s)   { _LATB7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_Init(const bool d, const bool s) { _LATB7 = s; _TRISB7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_Dispose(void)      { _TRISB7 = 1; _LATB7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB7_GetOpenDrain(void) { return(_ODCB7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetOpenDrain(const bool a) { _ODCB7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB7_GetPullUp(void)    { return(_CNPUB7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetPullUp(const bool a)  { _CNPUB7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB7_GetPullDown(void)  { return(_CNPUB7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetPullDown(const bool a) { _CNPUB7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetAnalog(void)    { _ANSELB7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetDigital(void)   { _ANSELB7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB7

// Function declarations of port pin RB8
#if defined (_TRISB8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB8_Get(void)          { return((bool)_RB8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_Set(void)          { asm volatile ("bset _LATB, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_Clear(void)        { asm volatile ("bclr _LATB, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_Toggle(void)       { asm volatile ("btg _LATB, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetInput(void)     { asm volatile ("bset _TRISB, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetOutput(void)    { asm volatile ("bclr _TRISB, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetState(const bool s)   { _LATB8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_Init(const bool d, const bool s) { _LATB8 = s; _TRISB8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_Dispose(void)      { _TRISB8 = 1; _LATB8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB8_GetOpenDrain(void) { return(_ODCB8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetOpenDrain(const bool a) { _ODCB8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB8_GetPullUp(void)    { return(_CNPUB8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetPullUp(const bool a)  { _CNPUB8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB8_GetPullDown(void)  { return(_CNPUB8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetPullDown(const bool a) { _CNPUB8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetAnalog(void)    { _ANSELB8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetDigital(void)   { _ANSELB8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB8

