areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RB9
#if defined (_TRISB9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB9_Get(void)          { return((bool)_RB9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_Set(void)          { asm volatile ("bset _LATB, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_Clear(void)        { asm volatile ("bclr _LATB, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_Toggle(void)       { asm volatile ("btg _LATB, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetInput(void)     { asm volatile ("bset _TRISB, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetOutput(void)    { asm volatile ("bclr _TRISB, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetState(const bool s)   { _LATB9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_Init(const bool d, const bool s) { _LATB9 = s; _TRISB9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_Dispose(void)      { _TRISB9 = 1; _LATB9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB9_GetOpenDrain(void) { return(_ODCB9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetOpenDrain(const bool a) { _ODCB9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB9_GetPullUp(void)    { return(_CNPUB9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetPullUp(const bool a)  { _CNPUB9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB9_GetPullDown(void)  { return(_CNPUB9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetPullDown(const bool a) { _CNPUB9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetAnalog(void)    { _ANSELB9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetDigital(void)   { _ANSELB9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB9

// Function declarations of port pin RB10
#if defined (_TRISB10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB10_Get(void)         { return((bool)_RB10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_Set(void)         { asm volatile ("bset _LATB, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_Clear(void)       { asm volatile ("bclr _LATB, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_Toggle(void)      { asm volatile ("btg _LATB, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetInput(void)    { asm volatile ("bset _TRISB, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetOutput(void)   { asm volatile ("bclr _TRISB, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetState(const bool s)  { _LATB10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_Init(const bool d, const bool s) { _LATB10 = s; _TRISB10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_Dispose(void)     { _TRISB10 = 1; _LATB10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB10_GetOpenDrain(void) { return(_ODCB10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetOpenDrain(const bool a) { _ODCB10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB10_GetPullUp(void)   { return(_CNPUB10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetPullUp(const bool a) { _CNPUB10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB10_GetPullDown(void) { return(_CNPUB10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetPullDown(const bool a) { _CNPUB10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetAnalog(void)   { _ANSELB10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetDigital(void)  { _ANSELB10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB10

