areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RB11
#if defined (_TRISB11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB11_Get(void)         { return((bool)_RB11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_Set(void)         { asm volatile ("bset _LATB, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_Clear(void)       { asm volatile ("bclr _LATB, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_Toggle(void)      { asm volatile ("btg _LATB, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetInput(void)    { asm volatile ("bset _TRISB, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetOutput(void)   { asm volatile ("bclr _TRISB, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetState(const bool s)  { _LATB11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_Init(const bool d, const bool s) { _LATB11 = s; _TRISB11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_Dispose(void)     { _TRISB11 = 1; _LATB11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB11_GetOpenDrain(void) { return(_ODCB11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetOpenDrain(const bool a) { _ODCB11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB11_GetPullUp(void)   { return(_CNPUB11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetPullUp(const bool a) { _CNPUB11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB11_GetPullDown(void) { return(_CNPUB11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetPullDown(const bool a) { _CNPUB11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetAnalog(void)   { _ANSELB11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetDigital(void)  { _ANSELB11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB11

// Function declarations of port pin RB12
#if defined (_TRISB12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB12_Get(void)         { return((bool)_RB12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_Set(void)         { asm volatile ("bset _LATB, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_Clear(void)       { asm volatile ("bclr _LATB, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_Toggle(void)      { asm volatile ("btg _LATB, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetInput(void)    { asm volatile ("bset _TRISB, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetOutput(void)   { asm volatile ("bclr _TRISB, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetState(const bool s)  { _LATB12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_Init(const bool d, const bool s) { _LATB12 = s; _TRISB12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_Dispose(void)     { _TRISB12 = 1; _LATB12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB12_GetOpenDrain(void) { return(_ODCB12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetOpenDrain(const bool a) { _ODCB12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB12_GetPullUp(void)   { return(_CNPUB12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetPullUp(const bool a) { _CNPUB12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB12_GetPullDown(void) { return(_CNPUB12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetPullDown(const bool a) { _CNPUB12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetAnalog(void)   { _ANSELB12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetDigital(void)  { _ANSELB12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB12

