areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RB13
#if defined (_TRISB13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB13_Get(void)         { return((bool)_RB13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_Set(void)         { asm volatile ("bset _LATB, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_Clear(void)       { asm volatile ("bclr _LATB, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_Toggle(void)      { asm volatile ("btg _LATB, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetInput(void)    { asm volatile ("bset _TRISB, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetOutput(void)   { asm volatile ("bclr _TRISB, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetState(const bool s)  { _LATB13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_Init(const bool d, const bool s) { _LATB13 = s; _TRISB13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_Dispose(void)     { _TRISB13 = 1; _LATB13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB13_GetOpenDrain(void) { return(_ODCB13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetOpenDrain(const bool a) { _ODCB13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB13_GetPullUp(void)   { return(_CNPUB13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetPullUp(const bool a) { _CNPUB13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB13_GetPullDown(void) { return(_CNPUB13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetPullDown(const bool a) { _CNPUB13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetAnalog(void)   { _ANSELB13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetDigital(void)  { _ANSELB13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB13

// Function declarations of port pin RB14
#if defined (_TRISB14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB14_Get(void)         { return((bool)_RB14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_Set(void)         { asm volatile ("bset _LATB, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_Clear(void)       { asm volatile ("bclr _LATB, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_Toggle(void)      { asm volatile ("btg _LATB, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetInput(void)    { asm volatile ("bset _TRISB, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetOutput(void)   { asm volatile ("bclr _TRISB, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetState(const bool s)  { _LATB14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_Init(const bool d, const bool s) { _LATB14 = s; _TRISB14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_Dispose(void)     { _TRISB14 = 1; _LATB14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB14_GetOpenDrain(void) { return(_ODCB14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetOpenDrain(const bool a) { _ODCB14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB14_GetPullUp(void)   { return(_CNPUB14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetPullUp(const bool a) { _CNPUB14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB14_GetPullDown(void) { return(_CNPUB14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetPullDown(const bool a) { _CNPUB14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetAnalog(void)   { _ANSELB14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetDigital(void)  { _ANSELB14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

