areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RB14

// Function declarations of port pin RB15
#if defined (_TRISB15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB15_Get(void)         { return((bool)_RB15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_Set(void)         { asm volatile ("bset _LATB, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_Clear(void)       { asm volatile ("bclr _LATB, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_Toggle(void)      { asm volatile ("btg _LATB, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetInput(void)    { asm volatile ("bset _TRISB, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetOutput(void)   { asm volatile ("bclr _TRISB, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetState(const bool s)  { _LATB15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_Init(const bool d, const bool s) { _LATB15 = s; _TRISB15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_Dispose(void)     { _TRISB15 = 1; _LATB15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB15_GetOpenDrain(void) { return(_ODCB15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetOpenDrain(const bool a) { _ODCB15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB15_GetPullUp(void)   { return(_CNPUB15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetPullUp(const bool a) { _CNPUB15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RB15_GetPullDown(void) { return(_CNPUB15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetPullDown(const bool a) { _CNPUB15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELB15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetAnalog(void)   { _ANSELB15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELB15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetDigital(void)  { _ANSELB15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RB15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RB15

// Function declarations of port pin RC0
#if defined (_TRISC0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC0_Get(void)          { return((bool)_RC0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_Set(void)          { asm volatile ("bset _LATC, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_Clear(void)        { asm volatile ("bclr _LATC, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_Toggle(void)       { asm volatile ("btg _LATC, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetInput(void)     { asm volatile ("bset _TRISC, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetOutput(void)    { asm volatile ("bclr _TRISC, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetState(const bool s)   { _LATC0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_Init(const bool d, const bool s) { _LATC0 = s; _TRISC0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_Dispose(void)      { _TRISC0 = 1; _LATC0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC0_GetOpenDrain(void) { return(_ODCC0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetOpenDrain(const bool a) { _ODCC0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC0_GetPullUp(void)    { return(_CNPUC0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetPullUp(const bool a)  { _CNPUC0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC0_GetPullDown(void)  { return(_CNPUC0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetPullDown(const bool a) { _CNPUC0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetAnalog(void)    { _ANSELC0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetDigital(void)   { _ANSELC0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

