areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RC0

// Function declarations of port pin RC1
#if defined (_TRISC1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC1_Get(void)          { return((bool)_RC1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_Set(void)          { asm volatile ("bset _LATC, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_Clear(void)        { asm volatile ("bclr _LATC, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_Toggle(void)       { asm volatile ("btg _LATC, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetInput(void)     { asm volatile ("bset _TRISC, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetOutput(void)    { asm volatile ("bclr _TRISC, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetState(const bool s)   { _LATC1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_Init(const bool d, const bool s) { _LATC1 = s; _TRISC1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_Dispose(void)      { _TRISC1 = 1; _LATC1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC1_GetOpenDrain(void) { return(_ODCC1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetOpenDrain(const bool a) { _ODCC1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC1_GetPullUp(void)    { return(_CNPUC1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetPullUp(const bool a)  { _CNPUC1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC1_GetPullDown(void)  { return(_CNPUC1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetPullDown(const bool a) { _CNPUC1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetAnalog(void)    { _ANSELC1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetDigital(void)   { _ANSELC1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC1

// Function declarations of port pin RC2
#if defined (_TRISC2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC2_Get(void)          { return((bool)_RC2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_Set(void)          { asm volatile ("bset _LATC, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_Clear(void)        { asm volatile ("bclr _LATC, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_Toggle(void)       { asm volatile ("btg _LATC, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetInput(void)     { asm volatile ("bset _TRISC, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetOutput(void)    { asm volatile ("bclr _TRISC, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetState(const bool s)   { _LATC2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_Init(const bool d, const bool s) { _LATC2 = s; _TRISC2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_Dispose(void)      { _TRISC2 = 1; _LATC2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC2_GetOpenDrain(void) { return(_ODCC2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetOpenDrain(const bool a) { _ODCC2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC2_GetPullUp(void)    { return(_CNPUC2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetPullUp(const bool a)  { _CNPUC2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC2_GetPullDown(void)  { return(_CNPUC2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetPullDown(const bool a) { _CNPUC2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetAnalog(void)    { _ANSELC2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetDigital(void)   { _ANSELC2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

