areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RC2

// Function declarations of port pin RC3
#if defined (_TRISC3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC3_Get(void)          { return((bool)_RC3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_Set(void)          { asm volatile ("bset _LATC, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_Clear(void)        { asm volatile ("bclr _LATC, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_Toggle(void)       { asm volatile ("btg _LATC, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetInput(void)     { asm volatile ("bset _TRISC, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetOutput(void)    { asm volatile ("bclr _TRISC, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetState(const bool s)   { _LATC3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_Init(const bool d, const bool s) { _LATC3 = s; _TRISC3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_Dispose(void)      { _TRISC3 = 1; _LATC3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC3_GetOpenDrain(void) { return(_ODCC3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetOpenDrain(const bool a) { _ODCC3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC3_GetPullUp(void)    { return(_CNPUC3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetPullUp(const bool a)  { _CNPUC3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC3_GetPullDown(void)  { return(_CNPUC3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetPullDown(const bool a) { _CNPUC3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetAnalog(void)    { _ANSELC3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetDigital(void)   { _ANSELC3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC3

// Function declarations of port pin RC4
#if defined (_TRISC4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC4_Get(void)          { return((bool)_RC4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_Set(void)          { asm volatile ("bset _LATC, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_Clear(void)        { asm volatile ("bclr _LATC, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_Toggle(void)       { asm volatile ("btg _LATC, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetInput(void)     { asm volatile ("bset _TRISC, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetOutput(void)    { asm volatile ("bclr _TRISC, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetState(const bool s)   { _LATC4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_Init(const bool d, const bool s) { _LATC4 = s; _TRISC4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_Dispose(void)      { _TRISC4 = 1; _LATC4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC4_GetOpenDrain(void) { return(_ODCC4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetOpenDrain(const bool a) { _ODCC4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC4_GetPullUp(void)    { return(_CNPUC4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetPullUp(const bool a)  { _CNPUC4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC4_GetPullDown(void)  { return(_CNPUC4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetPullDown(const bool a) { _CNPUC4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetAnalog(void)    { _ANSELC4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetDigital(void)   { _ANSELC4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC4

// Function declarations of port pin RC5
#if defined (_TRISC5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC5_Get(void)          { return((bool)_RC5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_Set(void)          { asm volatile ("bset _LATC, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_Clear(void)        { asm volatile ("bclr _LATC, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_Toggle(void)       { asm volatile ("btg _LATC, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetInput(void)     { asm volatile ("bset _TRISC, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetOutput(void)    { asm volatile ("bclr _TRISC, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetState(const bool s)   { _LATC5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_Init(const bool d, const bool s) { _LATC5 = s; _TRISC5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_Dispose(void)      { _TRISC5 = 1; _LATC5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC5_GetOpenDrain(void) { return(_ODCC5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetOpenDrain(const bool a) { _ODCC5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC5_GetPullUp(void)    { return(_CNPUC5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetPullUp(const bool a)  { _CNPUC5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC5_GetPullDown(void)  { return(_CNPUC5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetPullDown(const bool a) { _CNPUC5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetAnalog(void)    { _ANSELC5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetDigital(void)   { _ANSELC5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC5

