areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RC6
#if defined (_TRISC6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC6_Get(void)          { return((bool)_RC6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_Set(void)          { asm volatile ("bset _LATC, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_Clear(void)        { asm volatile ("bclr _LATC, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_Toggle(void)       { asm volatile ("btg _LATC, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetInput(void)     { asm volatile ("bset _TRISC, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetOutput(void)    { asm volatile ("bclr _TRISC, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetState(const bool s)   { _LATC6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_Init(const bool d, const bool s) { _LATC6 = s; _TRISC6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_Dispose(void)      { _TRISC6 = 1; _LATC6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC6_GetOpenDrain(void) { return(_ODCC6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetOpenDrain(const bool a) { _ODCC6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC6_GetPullUp(void)    { return(_CNPUC6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetPullUp(const bool a)  { _CNPUC6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC6_GetPullDown(void)  { return(_CNPUC6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetPullDown(const bool a) { _CNPUC6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetAnalog(void)    { _ANSELC6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetDigital(void)   { _ANSELC6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC6

// Function declarations of port pin RC7
#if defined (_TRISC7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC7_Get(void)          { return((bool)_RC7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_Set(void)          { asm volatile ("bset _LATC, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_Clear(void)        { asm volatile ("bclr _LATC, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_Toggle(void)       { asm volatile ("btg _LATC, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetInput(void)     { asm volatile ("bset _TRISC, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetOutput(void)    { asm volatile ("bclr _TRISC, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetState(const bool s)   { _LATC7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_Init(const bool d, const bool s) { _LATC7 = s; _TRISC7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_Dispose(void)      { _TRISC7 = 1; _LATC7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC7_GetOpenDrain(void) { return(_ODCC7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetOpenDrain(const bool a) { _ODCC7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC7_GetPullUp(void)    { return(_CNPUC7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetPullUp(const bool a)  { _CNPUC7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC7_GetPullDown(void)  { return(_CNPUC7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetPullDown(const bool a) { _CNPUC7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetAnalog(void)    { _ANSELC7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetDigital(void)   { _ANSELC7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC7

// Function declarations of port pin RC8
#if defined (_TRISC8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC8_Get(void)          { return((bool)_RC8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_Set(void)          { asm volatile ("bset _LATC, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_Clear(void)        { asm volatile ("bclr _LATC, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_Toggle(void)       { asm volatile ("btg _LATC, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetInput(void)     { asm volatile ("bset _TRISC, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetOutput(void)    { asm volatile ("bclr _TRISC, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetState(const bool s)   { _LATC8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_Init(const bool d, const bool s) { _LATC8 = s; _TRISC8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_Dispose(void)      { _TRISC8 = 1; _LATC8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC8_GetOpenDrain(void) { return(_ODCC8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetOpenDrain(const bool a) { _ODCC8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC8_GetPullUp(void)    { return(_CNPUC8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetPullUp(const bool a)  { _CNPUC8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC8_GetPullDown(void)  { return(_CNPUC8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetPullDown(const bool a) { _CNPUC8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetAnalog(void)    { _ANSELC8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetDigital(void)   { _ANSELC8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC8

// Function declarations of port pin RC9
#if defined (_TRISC9)

