areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC9_Get(void)          { return((bool)_RC9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_Set(void)          { asm volatile ("bset _LATC, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_Clear(void)        { asm volatile ("bclr _LATC, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_Toggle(void)       { asm volatile ("btg _LATC, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetInput(void)     { asm volatile ("bset _TRISC, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetOutput(void)    { asm volatile ("bclr _TRISC, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetState(const bool s)   { _LATC9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_Init(const bool d, const bool s) { _LATC9 = s; _TRISC9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_Dispose(void)      { _TRISC9 = 1; _LATC9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC9_GetOpenDrain(void) { return(_ODCC9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetOpenDrain(const bool a) { _ODCC9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC9_GetPullUp(void)    { return(_CNPUC9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetPullUp(const bool a)  { _CNPUC9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC9_GetPullDown(void)  { return(_CNPUC9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetPullDown(const bool a) { _CNPUC9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetAnalog(void)    { _ANSELC9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetDigital(void)   { _ANSELC9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC9

// Function declarations of port pin RC10
#if defined (_TRISC10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC10_Get(void)         { return((bool)_RC10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_Set(void)         { asm volatile ("bset _LATC, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_Clear(void)       { asm volatile ("bclr _LATC, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_Toggle(void)      { asm volatile ("btg _LATC, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetInput(void)    { asm volatile ("bset _TRISC, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetOutput(void)   { asm volatile ("bclr _TRISC, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetState(const bool s)  { _LATC10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_Init(const bool d, const bool s) { _LATC10 = s; _TRISC10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_Dispose(void)     { _TRISC10 = 1; _LATC10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC10_GetOpenDrain(void) { return(_ODCC10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetOpenDrain(const bool a) { _ODCC10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC10_GetPullUp(void)   { return(_CNPUC10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetPullUp(const bool a) { _CNPUC10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC10_GetPullDown(void) { return(_CNPUC10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetPullDown(const bool a) { _CNPUC10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetAnalog(void)   { _ANSELC10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetDigital(void)  { _ANSELC10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC10

// Function declarations of port pin RC11
#if defined (_TRISC11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC11_Get(void)         { return((bool)_RC11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_Set(void)         { asm volatile ("bset _LATC, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_Clear(void)       { asm volatile ("bclr _LATC, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_Toggle(void)      { asm volatile ("btg _LATC, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetInput(void)    { asm volatile ("bset _TRISC, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetOutput(void)   { asm volatile ("bclr _TRISC, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetState(const bool s)  { _LATC11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_Init(const bool d, const bool s) { _LATC11 = s; _TRISC11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_Dispose(void)     { _TRISC11 = 1; _LATC11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC11_GetOpenDrain(void) { return(_ODCC11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetOpenDrain(const bool a) { _ODCC11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC11_GetPullUp(void)   { return(_CNPUC11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetPullUp(const bool a) { _CNPUC11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC11_GetPullDown(void) { return(_CNPUC11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetPullDown(const bool a) { _CNPUC11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetAnalog(void)   { _ANSELC11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetDigital(void)  { _ANSELC11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

