areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RC11

// Function declarations of port pin RC12
#if defined (_TRISC12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC12_Get(void)         { return((bool)_RC12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_Set(void)         { asm volatile ("bset _LATC, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_Clear(void)       { asm volatile ("bclr _LATC, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_Toggle(void)      { asm volatile ("btg _LATC, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetInput(void)    { asm volatile ("bset _TRISC, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetOutput(void)   { asm volatile ("bclr _TRISC, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetState(const bool s)  { _LATC12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_Init(const bool d, const bool s) { _LATC12 = s; _TRISC12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_Dispose(void)     { _TRISC12 = 1; _LATC12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC12_GetOpenDrain(void) { return(_ODCC12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetOpenDrain(const bool a) { _ODCC12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC12_GetPullUp(void)   { return(_CNPUC12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetPullUp(const bool a) { _CNPUC12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC12_GetPullDown(void) { return(_CNPUC12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetPullDown(const bool a) { _CNPUC12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetAnalog(void)   { _ANSELC12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetDigital(void)  { _ANSELC12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC12

// Function declarations of port pin RC13
#if defined (_TRISC13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC13_Get(void)         { return((bool)_RC13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_Set(void)         { asm volatile ("bset _LATC, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_Clear(void)       { asm volatile ("bclr _LATC, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_Toggle(void)      { asm volatile ("btg _LATC, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetInput(void)    { asm volatile ("bset _TRISC, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetOutput(void)   { asm volatile ("bclr _TRISC, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetState(const bool s)  { _LATC13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_Init(const bool d, const bool s) { _LATC13 = s; _TRISC13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_Dispose(void)     { _TRISC13 = 1; _LATC13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC13_GetOpenDrain(void) { return(_ODCC13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetOpenDrain(const bool a) { _ODCC13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC13_GetPullUp(void)   { return(_CNPUC13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetPullUp(const bool a) { _CNPUC13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC13_GetPullDown(void) { return(_CNPUC13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetPullDown(const bool a) { _CNPUC13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetAnalog(void)   { _ANSELC13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetDigital(void)  { _ANSELC13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

