areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RC13

// Function declarations of port pin RC14
#if defined (_TRISC14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC14_Get(void)         { return((bool)_RC14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_Set(void)         { asm volatile ("bset _LATC, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_Clear(void)       { asm volatile ("bclr _LATC, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_Toggle(void)      { asm volatile ("btg _LATC, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetInput(void)    { asm volatile ("bset _TRISC, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetOutput(void)   { asm volatile ("bclr _TRISC, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetState(const bool s)  { _LATC14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_Init(const bool d, const bool s) { _LATC14 = s; _TRISC14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_Dispose(void)     { _TRISC14 = 1; _LATC14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC14_GetOpenDrain(void) { return(_ODCC14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetOpenDrain(const bool a) { _ODCC14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC14_GetPullUp(void)   { return(_CNPUC14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetPullUp(const bool a) { _CNPUC14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC14_GetPullDown(void) { return(_CNPUC14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetPullDown(const bool a) { _CNPUC14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetAnalog(void)   { _ANSELC14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetDigital(void)  { _ANSELC14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC14

// Function declarations of port pin RC15
#if defined (_TRISC15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC15_Get(void)         { return((bool)_RC15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_Set(void)         { asm volatile ("bset _LATC, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_Clear(void)       { asm volatile ("bclr _LATC, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_Toggle(void)      { asm volatile ("btg _LATC, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetInput(void)    { asm volatile ("bset _TRISC, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetOutput(void)   { asm volatile ("bclr _TRISC, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetState(const bool s)  { _LATC15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_Init(const bool d, const bool s) { _LATC15 = s; _TRISC15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_Dispose(void)     { _TRISC15 = 1; _LATC15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC15_GetOpenDrain(void) { return(_ODCC15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetOpenDrain(const bool a) { _ODCC15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC15_GetPullUp(void)   { return(_CNPUC15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetPullUp(const bool a) { _CNPUC15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RC15_GetPullDown(void) { return(_CNPUC15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetPullDown(const bool a) { _CNPUC15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELC15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetAnalog(void)   { _ANSELC15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELC15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetDigital(void)  { _ANSELC15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RC15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RC15

// Function declarations of port pin RD0
#if defined (_TRISD0)

