areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD0_Get(void)          { return((bool)_RD0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_Set(void)          { asm volatile ("bset _LATD, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_Clear(void)        { asm volatile ("bclr _LATD, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_Toggle(void)       { asm volatile ("btg _LATD, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetInput(void)     { asm volatile ("bset _TRISD, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetOutput(void)    { asm volatile ("bclr _TRISD, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetState(const bool s)   { _LATD0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_Init(const bool d, const bool s) { _LATD0 = s; _TRISD0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_Dispose(void)      { _TRISD0 = 1; _LATD0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD0_GetOpenDrain(void) { return(_ODCD0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetOpenDrain(const bool a) { _ODCD0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD0_GetPullUp(void)    { return(_CNPUD0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetPullUp(const bool a)  { _CNPUD0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD0_GetPullDown(void)  { return(_CNPUD0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetPullDown(const bool a) { _CNPUD0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetAnalog(void)    { _ANSELD0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetDigital(void)   { _ANSELD0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD0

// Function declarations of port pin RD1
#if defined (_TRISD1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD1_Get(void)          { return((bool)_RD1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_Set(void)          { asm volatile ("bset _LATD, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_Clear(void)        { asm volatile ("bclr _LATD, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_Toggle(void)       { asm volatile ("btg _LATD, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetInput(void)     { asm volatile ("bset _TRISD, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetOutput(void)    { asm volatile ("bclr _TRISD, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetState(const bool s)   { _LATD1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_Init(const bool d, const bool s) { _LATD1 = s; _TRISD1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_Dispose(void)      { _TRISD1 = 1; _LATD1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD1_GetOpenDrain(void) { return(_ODCD1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetOpenDrain(const bool a) { _ODCD1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD1_GetPullUp(void)    { return(_CNPUD1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetPullUp(const bool a)  { _CNPUD1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD1_GetPullDown(void)  { return(_CNPUD1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetPullDown(const bool a) { _CNPUD1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetAnalog(void)    { _ANSELD1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetDigital(void)   { _ANSELD1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD1

// Function declarations of port pin RD2
#if defined (_TRISD2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD2_Get(void)          { return((bool)_RD2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_Set(void)          { asm volatile ("bset _LATD, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_Clear(void)        { asm volatile ("bclr _LATD, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_Toggle(void)       { asm volatile ("btg _LATD, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetInput(void)     { asm volatile ("bset _TRISD, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetOutput(void)    { asm volatile ("bclr _TRISD, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetState(const bool s)   { _LATD2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_Init(const bool d, const bool s) { _LATD2 = s; _TRISD2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_Dispose(void)      { _TRISD2 = 1; _LATD2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD2_GetOpenDrain(void) { return(_ODCD2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetOpenDrain(const bool a) { _ODCD2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD2_GetPullUp(void)    { return(_CNPUD2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetPullUp(const bool a)  { _CNPUD2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD2_GetPullDown(void)  { return(_CNPUD2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetPullDown(const bool a) { _CNPUD2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetAnalog(void)    { _ANSELD2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetDigital(void)   { _ANSELD2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD2

