areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RD3
#if defined (_TRISD3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD3_Get(void)          { return((bool)_RD3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_Set(void)          { asm volatile ("bset _LATD, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_Clear(void)        { asm volatile ("bclr _LATD, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_Toggle(void)       { asm volatile ("btg _LATD, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetInput(void)     { asm volatile ("bset _TRISD, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetOutput(void)    { asm volatile ("bclr _TRISD, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetState(const bool s)   { _LATD3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_Init(const bool d, const bool s) { _LATD3 = s; _TRISD3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_Dispose(void)      { _TRISD3 = 1; _LATD3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD3_GetOpenDrain(void) { return(_ODCD3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetOpenDrain(const bool a) { _ODCD3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD3_GetPullUp(void)    { return(_CNPUD3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetPullUp(const bool a)  { _CNPUD3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD3_GetPullDown(void)  { return(_CNPUD3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetPullDown(const bool a) { _CNPUD3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetAnalog(void)    { _ANSELD3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetDigital(void)   { _ANSELD3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD3

// Function declarations of port pin RD4
#if defined (_TRISD4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD4_Get(void)          { return((bool)_RD4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_Set(void)          { asm volatile ("bset _LATD, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_Clear(void)        { asm volatile ("bclr _LATD, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_Toggle(void)       { asm volatile ("btg _LATD, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetInput(void)     { asm volatile ("bset _TRISD, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetOutput(void)    { asm volatile ("bclr _TRISD, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetState(const bool s)   { _LATD4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_Init(const bool d, const bool s) { _LATD4 = s; _TRISD4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_Dispose(void)      { _TRISD4 = 1; _LATD4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD4_GetOpenDrain(void) { return(_ODCD4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetOpenDrain(const bool a) { _ODCD4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD4_GetPullUp(void)    { return(_CNPUD4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetPullUp(const bool a)  { _CNPUD4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD4_GetPullDown(void)  { return(_CNPUD4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetPullDown(const bool a) { _CNPUD4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetAnalog(void)    { _ANSELD4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetDigital(void)   { _ANSELD4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD4

// Function declarations of port pin RD5
#if defined (_TRISD5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD5_Get(void)          { return((bool)_RD5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_Set(void)          { asm volatile ("bset _LATD, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_Clear(void)        { asm volatile ("bclr _LATD, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_Toggle(void)       { asm volatile ("btg _LATD, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetInput(void)     { asm volatile ("bset _TRISD, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetOutput(void)    { asm volatile ("bclr _TRISD, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetState(const bool s)   { _LATD5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_Init(const bool d, const bool s) { _LATD5 = s; _TRISD5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_Dispose(void)      { _TRISD5 = 1; _LATD5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD5_GetOpenDrain(void) { return(_ODCD5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetOpenDrain(const bool a) { _ODCD5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD5_GetPullUp(void)    { return(_CNPUD5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetPullUp(const bool a)  { _CNPUD5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD5_GetPullDown(void)  { return(_CNPUD5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetPullDown(const bool a) { _CNPUD5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetAnalog(void)    { _ANSELD5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetDigital(void)   { _ANSELD5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

