areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RD5

// Function declarations of port pin RD6
#if defined (_TRISD6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD6_Get(void)          { return((bool)_RD6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_Set(void)          { asm volatile ("bset _LATD, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_Clear(void)        { asm volatile ("bclr _LATD, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_Toggle(void)       { asm volatile ("btg _LATD, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetInput(void)     { asm volatile ("bset _TRISD, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetOutput(void)    { asm volatile ("bclr _TRISD, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetState(const bool s)   { _LATD6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_Init(const bool d, const bool s) { _LATD6 = s; _TRISD6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_Dispose(void)      { _TRISD6 = 1; _LATD6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD6_GetOpenDrain(void) { return(_ODCD6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetOpenDrain(const bool a) { _ODCD6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD6_GetPullUp(void)    { return(_CNPUD6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetPullUp(const bool a)  { _CNPUD6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD6_GetPullDown(void)  { return(_CNPUD6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetPullDown(const bool a) { _CNPUD6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetAnalog(void)    { _ANSELD6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetDigital(void)   { _ANSELD6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD6

// Function declarations of port pin RD7
#if defined (_TRISD7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD7_Get(void)          { return((bool)_RD7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_Set(void)          { asm volatile ("bset _LATD, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_Clear(void)        { asm volatile ("bclr _LATD, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_Toggle(void)       { asm volatile ("btg _LATD, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetInput(void)     { asm volatile ("bset _TRISD, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetOutput(void)    { asm volatile ("bclr _TRISD, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetState(const bool s)   { _LATD7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_Init(const bool d, const bool s) { _LATD7 = s; _TRISD7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_Dispose(void)      { _TRISD7 = 1; _LATD7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD7_GetOpenDrain(void) { return(_ODCD7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetOpenDrain(const bool a) { _ODCD7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD7_GetPullUp(void)    { return(_CNPUD7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetPullUp(const bool a)  { _CNPUD7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD7_GetPullDown(void)  { return(_CNPUD7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetPullDown(const bool a) { _CNPUD7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetAnalog(void)    { _ANSELD7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetDigital(void)   { _ANSELD7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

