areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RD7

// Function declarations of port pin RD8
#if defined (_TRISD8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD8_Get(void)          { return((bool)_RD8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_Set(void)          { asm volatile ("bset _LATD, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_Clear(void)        { asm volatile ("bclr _LATD, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_Toggle(void)       { asm volatile ("btg _LATD, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetInput(void)     { asm volatile ("bset _TRISD, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetOutput(void)    { asm volatile ("bclr _TRISD, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetState(const bool s)   { _LATD8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_Init(const bool d, const bool s) { _LATD8 = s; _TRISD8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_Dispose(void)      { _TRISD8 = 1; _LATD8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD8_GetOpenDrain(void) { return(_ODCD8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetOpenDrain(const bool a) { _ODCD8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD8_GetPullUp(void)    { return(_CNPUD8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetPullUp(const bool a)  { _CNPUD8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD8_GetPullDown(void)  { return(_CNPUD8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetPullDown(const bool a) { _CNPUD8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetAnalog(void)    { _ANSELD8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetDigital(void)   { _ANSELD8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD8

// Function declarations of port pin RD9
#if defined (_TRISD9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD9_Get(void)          { return((bool)_RD9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_Set(void)          { asm volatile ("bset _LATD, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_Clear(void)        { asm volatile ("bclr _LATD, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_Toggle(void)       { asm volatile ("btg _LATD, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetInput(void)     { asm volatile ("bset _TRISD, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetOutput(void)    { asm volatile ("bclr _TRISD, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetState(const bool s)   { _LATD9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_Init(const bool d, const bool s) { _LATD9 = s; _TRISD9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_Dispose(void)      { _TRISD9 = 1; _LATD9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD9_GetOpenDrain(void) { return(_ODCD9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetOpenDrain(const bool a) { _ODCD9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD9_GetPullUp(void)    { return(_CNPUD9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetPullUp(const bool a)  { _CNPUD9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD9_GetPullDown(void)  { return(_CNPUD9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetPullDown(const bool a) { _CNPUD9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetAnalog(void)    { _ANSELD9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetDigital(void)   { _ANSELD9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD9

