areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RD10
#if defined (_TRISD10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD10_Get(void)         { return((bool)_RD10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_Set(void)         { asm volatile ("bset _LATD, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_Clear(void)       { asm volatile ("bclr _LATD, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_Toggle(void)      { asm volatile ("btg _LATD, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetInput(void)    { asm volatile ("bset _TRISD, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetOutput(void)   { asm volatile ("bclr _TRISD, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetState(const bool s)  { _LATD10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_Init(const bool d, const bool s) { _LATD10 = s; _TRISD10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_Dispose(void)     { _TRISD10 = 1; _LATD10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD10_GetOpenDrain(void) { return(_ODCD10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetOpenDrain(const bool a) { _ODCD10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD10_GetPullUp(void)   { return(_CNPUD10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetPullUp(const bool a) { _CNPUD10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD10_GetPullDown(void) { return(_CNPUD10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetPullDown(const bool a) { _CNPUD10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetAnalog(void)   { _ANSELD10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetDigital(void)  { _ANSELD10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD10

// Function declarations of port pin RD11
#if defined (_TRISD11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD11_Get(void)         { return((bool)_RD11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_Set(void)         { asm volatile ("bset _LATD, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_Clear(void)       { asm volatile ("bclr _LATD, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_Toggle(void)      { asm volatile ("btg _LATD, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetInput(void)    { asm volatile ("bset _TRISD, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetOutput(void)   { asm volatile ("bclr _TRISD, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetState(const bool s)  { _LATD11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_Init(const bool d, const bool s) { _LATD11 = s; _TRISD11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_Dispose(void)     { _TRISD11 = 1; _LATD11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD11_GetOpenDrain(void) { return(_ODCD11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetOpenDrain(const bool a) { _ODCD11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD11_GetPullUp(void)   { return(_CNPUD11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetPullUp(const bool a) { _CNPUD11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD11_GetPullDown(void) { return(_CNPUD11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetPullDown(const bool a) { _CNPUD11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetAnalog(void)   { _ANSELD11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetDigital(void)  { _ANSELD11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD11

