areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RD12
#if defined (_TRISD12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD12_Get(void)         { return((bool)_RD12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_Set(void)         { asm volatile ("bset _LATD, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_Clear(void)       { asm volatile ("bclr _LATD, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_Toggle(void)      { asm volatile ("btg _LATD, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetInput(void)    { asm volatile ("bset _TRISD, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetOutput(void)   { asm volatile ("bclr _TRISD, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetState(const bool s)  { _LATD12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_Init(const bool d, const bool s) { _LATD12 = s; _TRISD12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_Dispose(void)     { _TRISD12 = 1; _LATD12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD12_GetOpenDrain(void) { return(_ODCD12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetOpenDrain(const bool a) { _ODCD12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD12_GetPullUp(void)   { return(_CNPUD12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetPullUp(const bool a) { _CNPUD12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD12_GetPullDown(void) { return(_CNPUD12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetPullDown(const bool a) { _CNPUD12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetAnalog(void)   { _ANSELD12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetDigital(void)  { _ANSELD12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD12

// Function declarations of port pin RD13
#if defined (_TRISD13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD13_Get(void)         { return((bool)_RD13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_Set(void)         { asm volatile ("bset _LATD, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_Clear(void)       { asm volatile ("bclr _LATD, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_Toggle(void)      { asm volatile ("btg _LATD, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetInput(void)    { asm volatile ("bset _TRISD, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetOutput(void)   { asm volatile ("bclr _TRISD, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetState(const bool s)  { _LATD13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_Init(const bool d, const bool s) { _LATD13 = s; _TRISD13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_Dispose(void)     { _TRISD13 = 1; _LATD13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD13_GetOpenDrain(void) { return(_ODCD13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetOpenDrain(const bool a) { _ODCD13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD13_GetPullUp(void)   { return(_CNPUD13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetPullUp(const bool a) { _CNPUD13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD13_GetPullDown(void) { return(_CNPUD13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetPullDown(const bool a) { _CNPUD13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetAnalog(void)   { _ANSELD13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetDigital(void)  { _ANSELD13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD13

// Function declarations of port pin RD14
#if defined (_TRISD14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD14_Get(void)         { return((bool)_RD14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_Set(void)         { asm volatile ("bset _LATD, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_Clear(void)       { asm volatile ("bclr _LATD, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_Toggle(void)      { asm volatile ("btg _LATD, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetInput(void)    { asm volatile ("bset _TRISD, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetOutput(void)   { asm volatile ("bclr _TRISD, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetState(const bool s)  { _LATD14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_Init(const bool d, const bool s) { _LATD14 = s; _TRISD14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_Dispose(void)     { _TRISD14 = 1; _LATD14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD14_GetOpenDrain(void) { return(_ODCD14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetOpenDrain(const bool a) { _ODCD14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD14_GetPullUp(void)   { return(_CNPUD14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetPullUp(const bool a) { _CNPUD14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD14_GetPullDown(void) { return(_CNPUD14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetPullDown(const bool a) { _CNPUD14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetAnalog(void)   { _ANSELD14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetDigital(void)  { _ANSELD14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RD14

// Function declarations of port pin RD15
#if defined (_TRISD15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD15_Get(void)         { return((bool)_RD15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_Set(void)         { asm volatile ("bset _LATD, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_Clear(void)       { asm volatile ("bclr _LATD, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_Toggle(void)      { asm volatile ("btg _LATD, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetInput(void)    { asm volatile ("bset _TRISD, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetOutput(void)   { asm volatile ("bclr _TRISD, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetState(const bool s)  { _LATD15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_Init(const bool d, const bool s) { _LATD15 = s; _TRISD15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_Dispose(void)     { _TRISD15 = 1; _LATD15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD15_GetOpenDrain(void) { return(_ODCD15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetOpenDrain(const bool a) { _ODCD15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD15_GetPullUp(void)   { return(_CNPUD15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetPullUp(const bool a) { _CNPUD15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RD15_GetPullDown(void) { return(_CNPUD15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetPullDown(const bool a) { _CNPUD15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELD15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetAnalog(void)   { _ANSELD15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELD15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetDigital(void)  { _ANSELD15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RD15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

