areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RD15

// Function declarations of port pin RE0
#if defined (_TRISE0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE0_Get(void)          { return((bool)_RE0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_Set(void)          { asm volatile ("bset _LATE, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_Clear(void)        { asm volatile ("bclr _LATE, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_Toggle(void)       { asm volatile ("btg _LATE, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetInput(void)     { asm volatile ("bset _TRISE, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetOutput(void)    { asm volatile ("bclr _TRISE, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetState(const bool s)   { _LATE0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_Init(const bool d, const bool s) { _LATE0 = s; _TRISE0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_Dispose(void)      { _TRISE0 = 1; _LATE0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE0_GetOpenDrain(void) { return(_ODCE0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetOpenDrain(const bool a) { _ODCE0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE0_GetPullUp(void)    { return(_CNPUE0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetPullUp(const bool a)  { _CNPUE0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE0_GetPullDown(void)  { return(_CNPUE0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetPullDown(const bool a) { _CNPUE0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetAnalog(void)    { _ANSELE0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetDigital(void)   { _ANSELE0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE0

// Function declarations of port pin RE1
#if defined (_TRISE1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE1_Get(void)          { return((bool)_RE1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_Set(void)          { asm volatile ("bset _LATE, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_Clear(void)        { asm volatile ("bclr _LATE, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_Toggle(void)       { asm volatile ("btg _LATE, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetInput(void)     { asm volatile ("bset _TRISE, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetOutput(void)    { asm volatile ("bclr _TRISE, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetState(const bool s)   { _LATE1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_Init(const bool d, const bool s) { _LATE1 = s; _TRISE1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_Dispose(void)      { _TRISE1 = 1; _LATE1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE1_GetOpenDrain(void) { return(_ODCE1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetOpenDrain(const bool a) { _ODCE1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE1_GetPullUp(void)    { return(_CNPUE1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetPullUp(const bool a)  { _CNPUE1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE1_GetPullDown(void)  { return(_CNPUE1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetPullDown(const bool a) { _CNPUE1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetAnalog(void)    { _ANSELE1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetDigital(void)   { _ANSELE1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

