areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RE1

// Function declarations of port pin RE2
#if defined (_TRISE2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE2_Get(void)          { return((bool)_RE2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_Set(void)          { asm volatile ("bset _LATE, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_Clear(void)        { asm volatile ("bclr _LATE, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_Toggle(void)       { asm volatile ("btg _LATE, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetInput(void)     { asm volatile ("bset _TRISE, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetOutput(void)    { asm volatile ("bclr _TRISE, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetState(const bool s)   { _LATE2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_Init(const bool d, const bool s) { _LATE2 = s; _TRISE2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_Dispose(void)      { _TRISE2 = 1; _LATE2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE2_GetOpenDrain(void) { return(_ODCE2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetOpenDrain(const bool a) { _ODCE2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE2_GetPullUp(void)    { return(_CNPUE2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetPullUp(const bool a)  { _CNPUE2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE2_GetPullDown(void)  { return(_CNPUE2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetPullDown(const bool a) { _CNPUE2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetAnalog(void)    { _ANSELE2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetDigital(void)   { _ANSELE2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE2

// Function declarations of port pin RE3
#if defined (_TRISE3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE3_Get(void)          { return((bool)_RE3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_Set(void)          { asm volatile ("bset _LATE, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_Clear(void)        { asm volatile ("bclr _LATE, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_Toggle(void)       { asm volatile ("btg _LATE, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetInput(void)     { asm volatile ("bset _TRISE, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetOutput(void)    { asm volatile ("bclr _TRISE, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetState(const bool s)   { _LATE3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_Init(const bool d, const bool s) { _LATE3 = s; _TRISE3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_Dispose(void)      { _TRISE3 = 1; _LATE3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE3_GetOpenDrain(void) { return(_ODCE3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetOpenDrain(const bool a) { _ODCE3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE3_GetPullUp(void)    { return(_CNPUE3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetPullUp(const bool a)  { _CNPUE3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE3_GetPullDown(void)  { return(_CNPUE3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetPullDown(const bool a) { _CNPUE3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetAnalog(void)    { _ANSELE3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetDigital(void)   { _ANSELE3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

