areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RE3

// Function declarations of port pin RE4
#if defined (_TRISE4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE4_Get(void)          { return((bool)_RE4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_Set(void)          { asm volatile ("bset _LATE, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_Clear(void)        { asm volatile ("bclr _LATE, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_Toggle(void)       { asm volatile ("btg _LATE, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetInput(void)     { asm volatile ("bset _TRISE, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetOutput(void)    { asm volatile ("bclr _TRISE, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetState(const bool s)   { _LATE4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_Init(const bool d, const bool s) { _LATE4 = s; _TRISE4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_Dispose(void)      { _TRISE4 = 1; _LATE4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE4_GetOpenDrain(void) { return(_ODCE4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetOpenDrain(const bool a) { _ODCE4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE4_GetPullUp(void)    { return(_CNPUE4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetPullUp(const bool a)  { _CNPUE4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE4_GetPullDown(void)  { return(_CNPUE4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetPullDown(const bool a) { _CNPUE4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetAnalog(void)    { _ANSELE4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetDigital(void)   { _ANSELE4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE4

// Function declarations of port pin RE5
#if defined (_TRISE5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE5_Get(void)          { return((bool)_RE5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_Set(void)          { asm volatile ("bset _LATE, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_Clear(void)        { asm volatile ("bclr _LATE, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_Toggle(void)       { asm volatile ("btg _LATE, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetInput(void)     { asm volatile ("bset _TRISE, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetOutput(void)    { asm volatile ("bclr _TRISE, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetState(const bool s)   { _LATE5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_Init(const bool d, const bool s) { _LATE5 = s; _TRISE5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_Dispose(void)      { _TRISE5 = 1; _LATE5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE5_GetOpenDrain(void) { return(_ODCE5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetOpenDrain(const bool a) { _ODCE5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE5_GetPullUp(void)    { return(_CNPUE5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetPullUp(const bool a)  { _CNPUE5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE5_GetPullDown(void)  { return(_CNPUE5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetPullDown(const bool a) { _CNPUE5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetAnalog(void)    { _ANSELE5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetDigital(void)   { _ANSELE5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE5

// Function declarations of port pin RE6
#if defined (_TRISE6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE6_Get(void)          { return((bool)_RE6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_Set(void)          { asm volatile ("bset _LATE, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_Clear(void)        { asm volatile ("bclr _LATE, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_Toggle(void)       { asm volatile ("btg _LATE, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetInput(void)     { asm volatile ("bset _TRISE, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetOutput(void)    { asm volatile ("bclr _TRISE, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetState(const bool s)   { _LATE6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_Init(const bool d, const bool s) { _LATE6 = s; _TRISE6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_Dispose(void)      { _TRISE6 = 1; _LATE6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE6_GetOpenDrain(void) { return(_ODCE6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetOpenDrain(const bool a) { _ODCE6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE6_GetPullUp(void)    { return(_CNPUE6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetPullUp(const bool a)  { _CNPUE6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE6_GetPullDown(void)  { return(_CNPUE6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetPullDown(const bool a) { _CNPUE6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetAnalog(void)    { _ANSELE6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetDigital(void)   { _ANSELE6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE6

