areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RE7
#if defined (_TRISE7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE7_Get(void)          { return((bool)_RE7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_Set(void)          { asm volatile ("bset _LATE, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_Clear(void)        { asm volatile ("bclr _LATE, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_Toggle(void)       { asm volatile ("btg _LATE, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetInput(void)     { asm volatile ("bset _TRISE, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetOutput(void)    { asm volatile ("bclr _TRISE, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetState(const bool s)   { _LATE7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_Init(const bool d, const bool s) { _LATE7 = s; _TRISE7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_Dispose(void)      { _TRISE7 = 1; _LATE7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE7_GetOpenDrain(void) { return(_ODCE7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetOpenDrain(const bool a) { _ODCE7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE7_GetPullUp(void)    { return(_CNPUE7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetPullUp(const bool a)  { _CNPUE7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE7_GetPullDown(void)  { return(_CNPUE7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetPullDown(const bool a) { _CNPUE7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetAnalog(void)    { _ANSELE7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetDigital(void)   { _ANSELE7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE7

// Function declarations of port pin RE8
#if defined (_TRISE8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE8_Get(void)          { return((bool)_RE8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_Set(void)          { asm volatile ("bset _LATE, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_Clear(void)        { asm volatile ("bclr _LATE, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_Toggle(void)       { asm volatile ("btg _LATE, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetInput(void)     { asm volatile ("bset _TRISE, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetOutput(void)    { asm volatile ("bclr _TRISE, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetState(const bool s)   { _LATE8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_Init(const bool d, const bool s) { _LATE8 = s; _TRISE8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_Dispose(void)      { _TRISE8 = 1; _LATE8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE8_GetOpenDrain(void) { return(_ODCE8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetOpenDrain(const bool a) { _ODCE8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE8_GetPullUp(void)    { return(_CNPUE8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetPullUp(const bool a)  { _CNPUE8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE8_GetPullDown(void)  { return(_CNPUE8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetPullDown(const bool a) { _CNPUE8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetAnalog(void)    { _ANSELE8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetDigital(void)   { _ANSELE8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

