areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RE8

// Function declarations of port pin RE9
#if defined (_TRISE9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE9_Get(void)          { return((bool)_RE9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_Set(void)          { asm volatile ("bset _LATE, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_Clear(void)        { asm volatile ("bclr _LATE, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_Toggle(void)       { asm volatile ("btg _LATE, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetInput(void)     { asm volatile ("bset _TRISE, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetOutput(void)    { asm volatile ("bclr _TRISE, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetState(const bool s)   { _LATE9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_Init(const bool d, const bool s) { _LATE9 = s; _TRISE9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_Dispose(void)      { _TRISE9 = 1; _LATE9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE9_GetOpenDrain(void) { return(_ODCE9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetOpenDrain(const bool a) { _ODCE9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE9_GetPullUp(void)    { return(_CNPUE9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetPullUp(const bool a)  { _CNPUE9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE9_GetPullDown(void)  { return(_CNPUE9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetPullDown(const bool a) { _CNPUE9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetAnalog(void)    { _ANSELE9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetDigital(void)   { _ANSELE9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE9

// Function declarations of port pin RE10
#if defined (_TRISE10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE10_Get(void)         { return((bool)_RE10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_Set(void)         { asm volatile ("bset _LATE, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_Clear(void)       { asm volatile ("bclr _LATE, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_Toggle(void)      { asm volatile ("btg _LATE, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetInput(void)    { asm volatile ("bset _TRISE, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetOutput(void)   { asm volatile ("bclr _TRISE, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetState(const bool s)  { _LATE10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_Init(const bool d, const bool s) { _LATE10 = s; _TRISE10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_Dispose(void)     { _TRISE10 = 1; _LATE10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE10_GetOpenDrain(void) { return(_ODCE10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetOpenDrain(const bool a) { _ODCE10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE10_GetPullUp(void)   { return(_CNPUE10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetPullUp(const bool a) { _CNPUE10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE10_GetPullDown(void) { return(_CNPUE10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetPullDown(const bool a) { _CNPUE10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetAnalog(void)   { _ANSELE10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetDigital(void)  { _ANSELE10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

