areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RE10

// Function declarations of port pin RE11
#if defined (_TRISE11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE11_Get(void)         { return((bool)_RE11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_Set(void)         { asm volatile ("bset _LATE, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_Clear(void)       { asm volatile ("bclr _LATE, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_Toggle(void)      { asm volatile ("btg _LATE, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetInput(void)    { asm volatile ("bset _TRISE, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetOutput(void)   { asm volatile ("bclr _TRISE, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetState(const bool s)  { _LATE11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_Init(const bool d, const bool s) { _LATE11 = s; _TRISE11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_Dispose(void)     { _TRISE11 = 1; _LATE11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE11_GetOpenDrain(void) { return(_ODCE11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetOpenDrain(const bool a) { _ODCE11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE11_GetPullUp(void)   { return(_CNPUE11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetPullUp(const bool a) { _CNPUE11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE11_GetPullDown(void) { return(_CNPUE11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetPullDown(const bool a) { _CNPUE11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetAnalog(void)   { _ANSELE11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetDigital(void)  { _ANSELE11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE11

// Function declarations of port pin RE12
#if defined (_TRISE12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE12_Get(void)         { return((bool)_RE12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_Set(void)         { asm volatile ("bset _LATE, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_Clear(void)       { asm volatile ("bclr _LATE, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_Toggle(void)      { asm volatile ("btg _LATE, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetInput(void)    { asm volatile ("bset _TRISE, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetOutput(void)   { asm volatile ("bclr _TRISE, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetState(const bool s)  { _LATE12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_Init(const bool d, const bool s) { _LATE12 = s; _TRISE12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_Dispose(void)     { _TRISE12 = 1; _LATE12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE12_GetOpenDrain(void) { return(_ODCE12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetOpenDrain(const bool a) { _ODCE12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE12_GetPullUp(void)   { return(_CNPUE12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetPullUp(const bool a) { _CNPUE12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE12_GetPullDown(void) { return(_CNPUE12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetPullDown(const bool a) { _CNPUE12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetAnalog(void)   { _ANSELE12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetDigital(void)  { _ANSELE12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

