areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RE12

// Function declarations of port pin RE13
#if defined (_TRISE13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE13_Get(void)         { return((bool)_RE13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_Set(void)         { asm volatile ("bset _LATE, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_Clear(void)       { asm volatile ("bclr _LATE, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_Toggle(void)      { asm volatile ("btg _LATE, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetInput(void)    { asm volatile ("bset _TRISE, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetOutput(void)   { asm volatile ("bclr _TRISE, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetState(const bool s)  { _LATE13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_Init(const bool d, const bool s) { _LATE13 = s; _TRISE13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_Dispose(void)     { _TRISE13 = 1; _LATE13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE13_GetOpenDrain(void) { return(_ODCE13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetOpenDrain(const bool a) { _ODCE13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE13_GetPullUp(void)   { return(_CNPUE13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetPullUp(const bool a) { _CNPUE13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE13_GetPullDown(void) { return(_CNPUE13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetPullDown(const bool a) { _CNPUE13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetAnalog(void)   { _ANSELE13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetDigital(void)  { _ANSELE13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE13

// Function declarations of port pin RE14
#if defined (_TRISE14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE14_Get(void)         { return((bool)_RE14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_Set(void)         { asm volatile ("bset _LATE, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_Clear(void)       { asm volatile ("bclr _LATE, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_Toggle(void)      { asm volatile ("btg _LATE, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetInput(void)    { asm volatile ("bset _TRISE, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetOutput(void)   { asm volatile ("bclr _TRISE, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetState(const bool s)  { _LATE14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_Init(const bool d, const bool s) { _LATE14 = s; _TRISE14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_Dispose(void)     { _TRISE14 = 1; _LATE14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE14_GetOpenDrain(void) { return(_ODCE14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetOpenDrain(const bool a) { _ODCE14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE14_GetPullUp(void)   { return(_CNPUE14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetPullUp(const bool a) { _CNPUE14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE14_GetPullDown(void) { return(_CNPUE14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetPullDown(const bool a) { _CNPUE14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetAnalog(void)   { _ANSELE14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetDigital(void)  { _ANSELE14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE14

