areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RE15
#if defined (_TRISE15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE15_Get(void)         { return((bool)_RE15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_Set(void)         { asm volatile ("bset _LATE, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_Clear(void)       { asm volatile ("bclr _LATE, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_Toggle(void)      { asm volatile ("btg _LATE, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetInput(void)    { asm volatile ("bset _TRISE, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetOutput(void)   { asm volatile ("bclr _TRISE, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetState(const bool s)  { _LATE15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_Init(const bool d, const bool s) { _LATE15 = s; _TRISE15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_Dispose(void)     { _TRISE15 = 1; _LATE15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE15_GetOpenDrain(void) { return(_ODCE15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetOpenDrain(const bool a) { _ODCE15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE15_GetPullUp(void)   { return(_CNPUE15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetPullUp(const bool a) { _CNPUE15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RE15_GetPullDown(void) { return(_CNPUE15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetPullDown(const bool a) { _CNPUE15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELE15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetAnalog(void)   { _ANSELE15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELE15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetDigital(void)  { _ANSELE15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RE15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RE15

// Function declarations of port pin RF0
#if defined (_TRISF0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF0_Get(void)          { return((bool)_RF0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_Set(void)          { asm volatile ("bset _LATF, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_Clear(void)        { asm volatile ("bclr _LATF, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_Toggle(void)       { asm volatile ("btg _LATF, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetInput(void)     { asm volatile ("bset _TRISF, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetOutput(void)    { asm volatile ("bclr _TRISF, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetState(const bool s)   { _LATF0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_Init(const bool d, const bool s) { _LATF0 = s; _TRISF0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_Dispose(void)      { _TRISF0 = 1; _LATF0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF0_GetOpenDrain(void) { return(_ODCF0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetOpenDrain(const bool a) { _ODCF0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF0_GetPullUp(void)    { return(_CNPUF0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetPullUp(const bool a)  { _CNPUF0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF0_GetPullDown(void)  { return(_CNPUF0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetPullDown(const bool a) { _CNPUF0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetAnalog(void)    { _ANSELF0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetDigital(void)   { _ANSELF0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF0

// Function declarations of port pin RF1
#if defined (_TRISF1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF1_Get(void)          { return((bool)_RF1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_Set(void)          { asm volatile ("bset _LATF, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_Clear(void)        { asm volatile ("bclr _LATF, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_Toggle(void)       { asm volatile ("btg _LATF, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetInput(void)     { asm volatile ("bset _TRISF, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetOutput(void)    { asm volatile ("bclr _TRISF, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetState(const bool s)   { _LATF1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_Init(const bool d, const bool s) { _LATF1 = s; _TRISF1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_Dispose(void)      { _TRISF1 = 1; _LATF1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF1_GetOpenDrain(void) { return(_ODCF1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetOpenDrain(const bool a) { _ODCF1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF1_GetPullUp(void)    { return(_CNPUF1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetPullUp(const bool a)  { _CNPUF1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF1_GetPullDown(void)  { return(_CNPUF1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetPullDown(const bool a) { _CNPUF1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetAnalog(void)    { _ANSELF1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetDigital(void)   { _ANSELF1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF1

