areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RF2
#if defined (_TRISF2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF2_Get(void)          { return((bool)_RF2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_Set(void)          { asm volatile ("bset _LATF, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_Clear(void)        { asm volatile ("bclr _LATF, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_Toggle(void)       { asm volatile ("btg _LATF, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetInput(void)     { asm volatile ("bset _TRISF, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetOutput(void)    { asm volatile ("bclr _TRISF, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetState(const bool s)   { _LATF2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_Init(const bool d, const bool s) { _LATF2 = s; _TRISF2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_Dispose(void)      { _TRISF2 = 1; _LATF2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF2_GetOpenDrain(void) { return(_ODCF2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetOpenDrain(const bool a) { _ODCF2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF2_GetPullUp(void)    { return(_CNPUF2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetPullUp(const bool a)  { _CNPUF2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF2_GetPullDown(void)  { return(_CNPUF2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetPullDown(const bool a) { _CNPUF2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetAnalog(void)    { _ANSELF2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetDigital(void)   { _ANSELF2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF2

// Function declarations of port pin RF3
#if defined (_TRISF3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF3_Get(void)          { return((bool)_RF3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_Set(void)          { asm volatile ("bset _LATF, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_Clear(void)        { asm volatile ("bclr _LATF, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_Toggle(void)       { asm volatile ("btg _LATF, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetInput(void)     { asm volatile ("bset _TRISF, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetOutput(void)    { asm volatile ("bclr _TRISF, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetState(const bool s)   { _LATF3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_Init(const bool d, const bool s) { _LATF3 = s; _TRISF3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_Dispose(void)      { _TRISF3 = 1; _LATF3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF3_GetOpenDrain(void) { return(_ODCF3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetOpenDrain(const bool a) { _ODCF3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF3_GetPullUp(void)    { return(_CNPUF3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetPullUp(const bool a)  { _CNPUF3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF3_GetPullDown(void)  { return(_CNPUF3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetPullDown(const bool a) { _CNPUF3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetAnalog(void)    { _ANSELF3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetDigital(void)   { _ANSELF3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF3

// Function declarations of port pin RF4
#if defined (_TRISF4)

