areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF4_Get(void)          { return((bool)_RF4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_Set(void)          { asm volatile ("bset _LATF, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_Clear(void)        { asm volatile ("bclr _LATF, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_Toggle(void)       { asm volatile ("btg _LATF, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetInput(void)     { asm volatile ("bset _TRISF, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetOutput(void)    { asm volatile ("bclr _TRISF, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetState(const bool s)   { _LATF4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_Init(const bool d, const bool s) { _LATF4 = s; _TRISF4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_Dispose(void)      { _TRISF4 = 1; _LATF4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF4_GetOpenDrain(void) { return(_ODCF4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetOpenDrain(const bool a) { _ODCF4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF4_GetPullUp(void)    { return(_CNPUF4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetPullUp(const bool a)  { _CNPUF4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF4_GetPullDown(void)  { return(_CNPUF4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetPullDown(const bool a) { _CNPUF4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetAnalog(void)    { _ANSELF4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetDigital(void)   { _ANSELF4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF4

// Function declarations of port pin RF5
#if defined (_TRISF5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF5_Get(void)          { return((bool)_RF5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_Set(void)          { asm volatile ("bset _LATF, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_Clear(void)        { asm volatile ("bclr _LATF, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_Toggle(void)       { asm volatile ("btg _LATF, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetInput(void)     { asm volatile ("bset _TRISF, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetOutput(void)    { asm volatile ("bclr _TRISF, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetState(const bool s)   { _LATF5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_Init(const bool d, const bool s) { _LATF5 = s; _TRISF5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_Dispose(void)      { _TRISF5 = 1; _LATF5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF5_GetOpenDrain(void) { return(_ODCF5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetOpenDrain(const bool a) { _ODCF5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF5_GetPullUp(void)    { return(_CNPUF5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetPullUp(const bool a)  { _CNPUF5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF5_GetPullDown(void)  { return(_CNPUF5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetPullDown(const bool a) { _CNPUF5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetAnalog(void)    { _ANSELF5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetDigital(void)   { _ANSELF5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF5

// Function declarations of port pin RF6
#if defined (_TRISF6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF6_Get(void)          { return((bool)_RF6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_Set(void)          { asm volatile ("bset _LATF, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_Clear(void)        { asm volatile ("bclr _LATF, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_Toggle(void)       { asm volatile ("btg _LATF, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetInput(void)     { asm volatile ("bset _TRISF, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetOutput(void)    { asm volatile ("bclr _TRISF, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetState(const bool s)   { _LATF6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_Init(const bool d, const bool s) { _LATF6 = s; _TRISF6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_Dispose(void)      { _TRISF6 = 1; _LATF6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF6_GetOpenDrain(void) { return(_ODCF6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetOpenDrain(const bool a) { _ODCF6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF6_GetPullUp(void)    { return(_CNPUF6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetPullUp(const bool a)  { _CNPUF6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF6_GetPullDown(void)  { return(_CNPUF6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetPullDown(const bool a) { _CNPUF6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetAnalog(void)    { _ANSELF6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetDigital(void)   { _ANSELF6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

