areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RF6

// Function declarations of port pin RF7
#if defined (_TRISF7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF7_Get(void)          { return((bool)_RF7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_Set(void)          { asm volatile ("bset _LATF, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_Clear(void)        { asm volatile ("bclr _LATF, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_Toggle(void)       { asm volatile ("btg _LATF, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetInput(void)     { asm volatile ("bset _TRISF, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetOutput(void)    { asm volatile ("bclr _TRISF, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetState(const bool s)   { _LATF7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_Init(const bool d, const bool s) { _LATF7 = s; _TRISF7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_Dispose(void)      { _TRISF7 = 1; _LATF7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF7_GetOpenDrain(void) { return(_ODCF7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetOpenDrain(const bool a) { _ODCF7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF7_GetPullUp(void)    { return(_CNPUF7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetPullUp(const bool a)  { _CNPUF7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF7_GetPullDown(void)  { return(_CNPUF7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetPullDown(const bool a) { _CNPUF7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetAnalog(void)    { _ANSELF7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetDigital(void)   { _ANSELF7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF7

// Function declarations of port pin RF8
#if defined (_TRISF8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF8_Get(void)          { return((bool)_RF8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_Set(void)          { asm volatile ("bset _LATF, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_Clear(void)        { asm volatile ("bclr _LATF, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_Toggle(void)       { asm volatile ("btg _LATF, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetInput(void)     { asm volatile ("bset _TRISF, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetOutput(void)    { asm volatile ("bclr _TRISF, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetState(const bool s)   { _LATF8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_Init(const bool d, const bool s) { _LATF8 = s; _TRISF8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_Dispose(void)      { _TRISF8 = 1; _LATF8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF8_GetOpenDrain(void) { return(_ODCF8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetOpenDrain(const bool a) { _ODCF8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF8_GetPullUp(void)    { return(_CNPUF8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetPullUp(const bool a)  { _CNPUF8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF8_GetPullDown(void)  { return(_CNPUF8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetPullDown(const bool a) { _CNPUF8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetAnalog(void)    { _ANSELF8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetDigital(void)   { _ANSELF8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF8

