areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RF9
#if defined (_TRISF9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF9_Get(void)          { return((bool)_RF9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_Set(void)          { asm volatile ("bset _LATF, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_Clear(void)        { asm volatile ("bclr _LATF, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_Toggle(void)       { asm volatile ("btg _LATF, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetInput(void)     { asm volatile ("bset _TRISF, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetOutput(void)    { asm volatile ("bclr _TRISF, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetState(const bool s)   { _LATF9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_Init(const bool d, const bool s) { _LATF9 = s; _TRISF9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_Dispose(void)      { _TRISF9 = 1; _LATF9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF9_GetOpenDrain(void) { return(_ODCF9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetOpenDrain(const bool a) { _ODCF9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF9_GetPullUp(void)    { return(_CNPUF9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetPullUp(const bool a)  { _CNPUF9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF9_GetPullDown(void)  { return(_CNPUF9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetPullDown(const bool a) { _CNPUF9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetAnalog(void)    { _ANSELF9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetDigital(void)   { _ANSELF9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF9

// Function declarations of port pin RF10
#if defined (_TRISF10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF10_Get(void)         { return((bool)_RF10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_Set(void)         { asm volatile ("bset _LATF, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_Clear(void)       { asm volatile ("bclr _LATF, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_Toggle(void)      { asm volatile ("btg _LATF, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetInput(void)    { asm volatile ("bset _TRISF, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetOutput(void)   { asm volatile ("bclr _TRISF, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetState(const bool s)  { _LATF10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_Init(const bool d, const bool s) { _LATF10 = s; _TRISF10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_Dispose(void)     { _TRISF10 = 1; _LATF10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF10_GetOpenDrain(void) { return(_ODCF10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetOpenDrain(const bool a) { _ODCF10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF10_GetPullUp(void)   { return(_CNPUF10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetPullUp(const bool a) { _CNPUF10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF10_GetPullDown(void) { return(_CNPUF10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetPullDown(const bool a) { _CNPUF10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetAnalog(void)   { _ANSELF10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetDigital(void)  { _ANSELF10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF10

