areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RF11
#if defined (_TRISF11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF11_Get(void)         { return((bool)_RF11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_Set(void)         { asm volatile ("bset _LATF, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_Clear(void)       { asm volatile ("bclr _LATF, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_Toggle(void)      { asm volatile ("btg _LATF, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetInput(void)    { asm volatile ("bset _TRISF, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetOutput(void)   { asm volatile ("bclr _TRISF, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetState(const bool s)  { _LATF11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_Init(const bool d, const bool s) { _LATF11 = s; _TRISF11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_Dispose(void)     { _TRISF11 = 1; _LATF11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF11_GetOpenDrain(void) { return(_ODCF11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetOpenDrain(const bool a) { _ODCF11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF11_GetPullUp(void)   { return(_CNPUF11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetPullUp(const bool a) { _CNPUF11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF11_GetPullDown(void) { return(_CNPUF11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetPullDown(const bool a) { _CNPUF11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetAnalog(void)   { _ANSELF11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetDigital(void)  { _ANSELF11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF11

// Function declarations of port pin RF12
#if defined (_TRISF12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF12_Get(void)         { return((bool)_RF12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_Set(void)         { asm volatile ("bset _LATF, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_Clear(void)       { asm volatile ("bclr _LATF, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_Toggle(void)      { asm volatile ("btg _LATF, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetInput(void)    { asm volatile ("bset _TRISF, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetOutput(void)   { asm volatile ("bclr _TRISF, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetState(const bool s)  { _LATF12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_Init(const bool d, const bool s) { _LATF12 = s; _TRISF12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_Dispose(void)     { _TRISF12 = 1; _LATF12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF12_GetOpenDrain(void) { return(_ODCF12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetOpenDrain(const bool a) { _ODCF12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF12_GetPullUp(void)   { return(_CNPUF12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetPullUp(const bool a) { _CNPUF12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF12_GetPullDown(void) { return(_CNPUF12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetPullDown(const bool a) { _CNPUF12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetAnalog(void)   { _ANSELF12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetDigital(void)  { _ANSELF12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF12

