areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RF13
#if defined (_TRISF13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF13_Get(void)         { return((bool)_RF13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_Set(void)         { asm volatile ("bset _LATF, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_Clear(void)       { asm volatile ("bclr _LATF, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_Toggle(void)      { asm volatile ("btg _LATF, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetInput(void)    { asm volatile ("bset _TRISF, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetOutput(void)   { asm volatile ("bclr _TRISF, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetState(const bool s)  { _LATF13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_Init(const bool d, const bool s) { _LATF13 = s; _TRISF13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_Dispose(void)     { _TRISF13 = 1; _LATF13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF13_GetOpenDrain(void) { return(_ODCF13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetOpenDrain(const bool a) { _ODCF13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF13_GetPullUp(void)   { return(_CNPUF13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetPullUp(const bool a) { _CNPUF13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF13_GetPullDown(void) { return(_CNPUF13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetPullDown(const bool a) { _CNPUF13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetAnalog(void)   { _ANSELF13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetDigital(void)  { _ANSELF13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF13

// Function declarations of port pin RF14
#if defined (_TRISF14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF14_Get(void)         { return((bool)_RF14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_Set(void)         { asm volatile ("bset _LATF, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_Clear(void)       { asm volatile ("bclr _LATF, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_Toggle(void)      { asm volatile ("btg _LATF, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetInput(void)    { asm volatile ("bset _TRISF, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetOutput(void)   { asm volatile ("bclr _TRISF, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetState(const bool s)  { _LATF14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_Init(const bool d, const bool s) { _LATF14 = s; _TRISF14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_Dispose(void)     { _TRISF14 = 1; _LATF14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF14_GetOpenDrain(void) { return(_ODCF14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetOpenDrain(const bool a) { _ODCF14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF14_GetPullUp(void)   { return(_CNPUF14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetPullUp(const bool a) { _CNPUF14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF14_GetPullDown(void) { return(_CNPUF14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetPullDown(const bool a) { _CNPUF14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetAnalog(void)   { _ANSELF14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetDigital(void)  { _ANSELF14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

