areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RF14

// Function declarations of port pin RF15
#if defined (_TRISF15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF15_Get(void)         { return((bool)_RF15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_Set(void)         { asm volatile ("bset _LATF, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_Clear(void)       { asm volatile ("bclr _LATF, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_Toggle(void)      { asm volatile ("btg _LATF, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetInput(void)    { asm volatile ("bset _TRISF, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetOutput(void)   { asm volatile ("bclr _TRISF, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetState(const bool s)  { _LATF15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_Init(const bool d, const bool s) { _LATF15 = s; _TRISF15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_Dispose(void)     { _TRISF15 = 1; _LATF15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF15_GetOpenDrain(void) { return(_ODCF15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetOpenDrain(const bool a) { _ODCF15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF15_GetPullUp(void)   { return(_CNPUF15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetPullUp(const bool a) { _CNPUF15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RF15_GetPullDown(void) { return(_CNPUF15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetPullDown(const bool a) { _CNPUF15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELF15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetAnalog(void)   { _ANSELF15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELF15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetDigital(void)  { _ANSELF15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RF15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RF15

// Function declarations of port pin RG0
#if defined (_TRISG0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG0_Get(void)          { return((bool)_RG0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_Set(void)          { asm volatile ("bset _LATG, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_Clear(void)        { asm volatile ("bclr _LATG, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_Toggle(void)       { asm volatile ("btg _LATG, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetInput(void)     { asm volatile ("bset _TRISG, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetOutput(void)    { asm volatile ("bclr _TRISG, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetState(const bool s)   { _LATG0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_Init(const bool d, const bool s) { _LATG0 = s; _TRISG0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_Dispose(void)      { _TRISG0 = 1; _LATG0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG0_GetOpenDrain(void) { return(_ODCG0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetOpenDrain(const bool a) { _ODCG0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG0_GetPullUp(void)    { return(_CNPUG0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetPullUp(const bool a)  { _CNPUG0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG0_GetPullDown(void)  { return(_CNPUG0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetPullDown(const bool a) { _CNPUG0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetAnalog(void)    { _ANSELG0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetDigital(void)   { _ANSELG0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

