areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RG0

// Function declarations of port pin RG1
#if defined (_TRISG1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG1_Get(void)          { return((bool)_RG1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_Set(void)          { asm volatile ("bset _LATG, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_Clear(void)        { asm volatile ("bclr _LATG, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_Toggle(void)       { asm volatile ("btg _LATG, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetInput(void)     { asm volatile ("bset _TRISG, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetOutput(void)    { asm volatile ("bclr _TRISG, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetState(const bool s)   { _LATG1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_Init(const bool d, const bool s) { _LATG1 = s; _TRISG1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_Dispose(void)      { _TRISG1 = 1; _LATG1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG1_GetOpenDrain(void) { return(_ODCG1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetOpenDrain(const bool a) { _ODCG1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG1_GetPullUp(void)    { return(_CNPUG1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetPullUp(const bool a)  { _CNPUG1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG1_GetPullDown(void)  { return(_CNPUG1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetPullDown(const bool a) { _CNPUG1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetAnalog(void)    { _ANSELG1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetDigital(void)   { _ANSELG1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG1

// Function declarations of port pin RG2
#if defined (_TRISG2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG2_Get(void)          { return((bool)_RG2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_Set(void)          { asm volatile ("bset _LATG, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_Clear(void)        { asm volatile ("bclr _LATG, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_Toggle(void)       { asm volatile ("btg _LATG, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetInput(void)     { asm volatile ("bset _TRISG, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetOutput(void)    { asm volatile ("bclr _TRISG, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetState(const bool s)   { _LATG2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_Init(const bool d, const bool s) { _LATG2 = s; _TRISG2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_Dispose(void)      { _TRISG2 = 1; _LATG2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG2_GetOpenDrain(void) { return(_ODCG2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetOpenDrain(const bool a) { _ODCG2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG2_GetPullUp(void)    { return(_CNPUG2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetPullUp(const bool a)  { _CNPUG2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG2_GetPullDown(void)  { return(_CNPUG2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetPullDown(const bool a) { _CNPUG2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetAnalog(void)    { _ANSELG2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetDigital(void)   { _ANSELG2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

