areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RG2

// Function declarations of port pin RG3
#if defined (_TRISG3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG3_Get(void)          { return((bool)_RG3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_Set(void)          { asm volatile ("bset _LATG, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_Clear(void)        { asm volatile ("bclr _LATG, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_Toggle(void)       { asm volatile ("btg _LATG, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetInput(void)     { asm volatile ("bset _TRISG, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetOutput(void)    { asm volatile ("bclr _TRISG, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetState(const bool s)   { _LATG3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_Init(const bool d, const bool s) { _LATG3 = s; _TRISG3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_Dispose(void)      { _TRISG3 = 1; _LATG3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG3_GetOpenDrain(void) { return(_ODCG3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetOpenDrain(const bool a) { _ODCG3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG3_GetPullUp(void)    { return(_CNPUG3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetPullUp(const bool a)  { _CNPUG3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG3_GetPullDown(void)  { return(_CNPUG3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetPullDown(const bool a) { _CNPUG3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetAnalog(void)    { _ANSELG3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetDigital(void)   { _ANSELG3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG3

// Function declarations of port pin RG4
#if defined (_TRISG4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG4_Get(void)          { return((bool)_RG4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_Set(void)          { asm volatile ("bset _LATG, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_Clear(void)        { asm volatile ("bclr _LATG, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_Toggle(void)       { asm volatile ("btg _LATG, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetInput(void)     { asm volatile ("bset _TRISG, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetOutput(void)    { asm volatile ("bclr _TRISG, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetState(const bool s)   { _LATG4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_Init(const bool d, const bool s) { _LATG4 = s; _TRISG4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_Dispose(void)      { _TRISG4 = 1; _LATG4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG4_GetOpenDrain(void) { return(_ODCG4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetOpenDrain(const bool a) { _ODCG4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG4_GetPullUp(void)    { return(_CNPUG4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetPullUp(const bool a)  { _CNPUG4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG4_GetPullDown(void)  { return(_CNPUG4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetPullDown(const bool a) { _CNPUG4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetAnalog(void)    { _ANSELG4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetDigital(void)   { _ANSELG4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG4

// Function declarations of port pin RG5
#if defined (_TRISG5)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG5_Get(void)          { return((bool)_RG5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_Set(void)          { asm volatile ("bset _LATG, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_Clear(void)        { asm volatile ("bclr _LATG, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_Toggle(void)       { asm volatile ("btg _LATG, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetInput(void)     { asm volatile ("bset _TRISG, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetOutput(void)    { asm volatile ("bclr _TRISG, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetState(const bool s)   { _LATG5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_Init(const bool d, const bool s) { _LATG5 = s; _TRISG5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_Dispose(void)      { _TRISG5 = 1; _LATG5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG5_GetOpenDrain(void) { return(_ODCG5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetOpenDrain(const bool a) { _ODCG5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG5_GetPullUp(void)    { return(_CNPUG5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetPullUp(const bool a)  { _CNPUG5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG5_GetPullDown(void)  { return(_CNPUG5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetPullDown(const bool a) { _CNPUG5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetAnalog(void)    { _ANSELG5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetDigital(void)   { _ANSELG5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG5

