areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RG6
#if defined (_TRISG6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG6_Get(void)          { return((bool)_RG6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_Set(void)          { asm volatile ("bset _LATG, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_Clear(void)        { asm volatile ("bclr _LATG, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_Toggle(void)       { asm volatile ("btg _LATG, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetInput(void)     { asm volatile ("bset _TRISG, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetOutput(void)    { asm volatile ("bclr _TRISG, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetState(const bool s)   { _LATG6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_Init(const bool d, const bool s) { _LATG6 = s; _TRISG6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_Dispose(void)      { _TRISG6 = 1; _LATG6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG6_GetOpenDrain(void) { return(_ODCG6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetOpenDrain(const bool a) { _ODCG6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG6_GetPullUp(void)    { return(_CNPUG6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetPullUp(const bool a)  { _CNPUG6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG6_GetPullDown(void)  { return(_CNPUG6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetPullDown(const bool a) { _CNPUG6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetAnalog(void)    { _ANSELG6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetDigital(void)   { _ANSELG6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG6

// Function declarations of port pin RG7
#if defined (_TRISG7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG7_Get(void)          { return((bool)_RG7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_Set(void)          { asm volatile ("bset _LATG, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_Clear(void)        { asm volatile ("bclr _LATG, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_Toggle(void)       { asm volatile ("btg _LATG, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetInput(void)     { asm volatile ("bset _TRISG, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetOutput(void)    { asm volatile ("bclr _TRISG, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetState(const bool s)   { _LATG7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_Init(const bool d, const bool s) { _LATG7 = s; _TRISG7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_Dispose(void)      { _TRISG7 = 1; _LATG7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG7_GetOpenDrain(void) { return(_ODCG7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetOpenDrain(const bool a) { _ODCG7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG7_GetPullUp(void)    { return(_CNPUG7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetPullUp(const bool a)  { _CNPUG7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG7_GetPullDown(void)  { return(_CNPUG7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetPullDown(const bool a) { _CNPUG7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetAnalog(void)    { _ANSELG7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetDigital(void)   { _ANSELG7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG7

// Function declarations of port pin RG8
#if defined (_TRISG8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG8_Get(void)          { return((bool)_RG8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_Set(void)          { asm volatile ("bset _LATG, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_Clear(void)        { asm volatile ("bclr _LATG, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_Toggle(void)       { asm volatile ("btg _LATG, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetInput(void)     { asm volatile ("bset _TRISG, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetOutput(void)    { asm volatile ("bclr _TRISG, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetState(const bool s)   { _LATG8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_Init(const bool d, const bool s) { _LATG8 = s; _TRISG8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_Dispose(void)      { _TRISG8 = 1; _LATG8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG8_GetOpenDrain(void) { return(_ODCG8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetOpenDrain(const bool a) { _ODCG8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG8_GetPullUp(void)    { return(_CNPUG8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetPullUp(const bool a)  { _CNPUG8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG8_GetPullDown(void)  { return(_CNPUG8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetPullDown(const bool a) { _CNPUG8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetAnalog(void)    { _ANSELG8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetDigital(void)   { _ANSELG8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG8

// Function declarations of port pin RG9
#if defined (_TRISG9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG9_Get(void)          { return((bool)_RG9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_Set(void)          { asm volatile ("bset _LATG, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_Clear(void)        { asm volatile ("bclr _LATG, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_Toggle(void)       { asm volatile ("btg _LATG, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetInput(void)     { asm volatile ("bset _TRISG, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetOutput(void)    { asm volatile ("bclr _TRISG, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetState(const bool s)   { _LATG9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_Init(const bool d, const bool s) { _LATG9 = s; _TRISG9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_Dispose(void)      { _TRISG9 = 1; _LATG9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG9_GetOpenDrain(void) { return(_ODCG9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetOpenDrain(const bool a) { _ODCG9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG9_GetPullUp(void)    { return(_CNPUG9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetPullUp(const bool a)  { _CNPUG9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG9_GetPullDown(void)  { return(_CNPUG9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetPullDown(const bool a) { _CNPUG9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetAnalog(void)    { _ANSELG9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetDigital(void)   { _ANSELG9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

