areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RG9

// Function declarations of port pin RG10
#if defined (_TRISG10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG10_Get(void)         { return((bool)_RG10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_Set(void)         { asm volatile ("bset _LATG, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_Clear(void)       { asm volatile ("bclr _LATG, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_Toggle(void)      { asm volatile ("btg _LATG, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetInput(void)    { asm volatile ("bset _TRISG, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetOutput(void)   { asm volatile ("bclr _TRISG, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetState(const bool s)  { _LATG10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_Init(const bool d, const bool s) { _LATG10 = s; _TRISG10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_Dispose(void)     { _TRISG10 = 1; _LATG10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG10_GetOpenDrain(void) { return(_ODCG10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetOpenDrain(const bool a) { _ODCG10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG10_GetPullUp(void)   { return(_CNPUG10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetPullUp(const bool a) { _CNPUG10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG10_GetPullDown(void) { return(_CNPUG10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetPullDown(const bool a) { _CNPUG10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetAnalog(void)   { _ANSELG10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetDigital(void)  { _ANSELG10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG10

// Function declarations of port pin RG11
#if defined (_TRISG11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG11_Get(void)         { return((bool)_RG11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_Set(void)         { asm volatile ("bset _LATG, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_Clear(void)       { asm volatile ("bclr _LATG, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_Toggle(void)      { asm volatile ("btg _LATG, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetInput(void)    { asm volatile ("bset _TRISG, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetOutput(void)   { asm volatile ("bclr _TRISG, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetState(const bool s)  { _LATG11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_Init(const bool d, const bool s) { _LATG11 = s; _TRISG11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_Dispose(void)     { _TRISG11 = 1; _LATG11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG11_GetOpenDrain(void) { return(_ODCG11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetOpenDrain(const bool a) { _ODCG11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG11_GetPullUp(void)   { return(_CNPUG11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetPullUp(const bool a) { _CNPUG11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG11_GetPullDown(void) { return(_CNPUG11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetPullDown(const bool a) { _CNPUG11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetAnalog(void)   { _ANSELG11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetDigital(void)  { _ANSELG11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

