areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RG11

// Function declarations of port pin RG12
#if defined (_TRISG12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG12_Get(void)         { return((bool)_RG12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_Set(void)         { asm volatile ("bset _LATG, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_Clear(void)       { asm volatile ("bclr _LATG, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_Toggle(void)      { asm volatile ("btg _LATG, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetInput(void)    { asm volatile ("bset _TRISG, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetOutput(void)   { asm volatile ("bclr _TRISG, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetState(const bool s)  { _LATG12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_Init(const bool d, const bool s) { _LATG12 = s; _TRISG12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_Dispose(void)     { _TRISG12 = 1; _LATG12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG12_GetOpenDrain(void) { return(_ODCG12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetOpenDrain(const bool a) { _ODCG12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG12_GetPullUp(void)   { return(_CNPUG12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetPullUp(const bool a) { _CNPUG12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG12_GetPullDown(void) { return(_CNPUG12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetPullDown(const bool a) { _CNPUG12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetAnalog(void)   { _ANSELG12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetDigital(void)  { _ANSELG12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG12

// Function declarations of port pin RG13
#if defined (_TRISG13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG13_Get(void)         { return((bool)_RG13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_Set(void)         { asm volatile ("bset _LATG, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_Clear(void)       { asm volatile ("bclr _LATG, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_Toggle(void)      { asm volatile ("btg _LATG, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetInput(void)    { asm volatile ("bset _TRISG, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetOutput(void)   { asm volatile ("bclr _TRISG, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetState(const bool s)  { _LATG13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_Init(const bool d, const bool s) { _LATG13 = s; _TRISG13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_Dispose(void)     { _TRISG13 = 1; _LATG13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG13_GetOpenDrain(void) { return(_ODCG13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetOpenDrain(const bool a) { _ODCG13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG13_GetPullUp(void)   { return(_CNPUG13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetPullUp(const bool a) { _CNPUG13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG13_GetPullDown(void) { return(_CNPUG13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetPullDown(const bool a) { _CNPUG13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetAnalog(void)   { _ANSELG13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetDigital(void)  { _ANSELG13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

