areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RG13

// Function declarations of port pin RG14
#if defined (_TRISG14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG14_Get(void)         { return((bool)_RG14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_Set(void)         { asm volatile ("bset _LATG, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_Clear(void)       { asm volatile ("bclr _LATG, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_Toggle(void)      { asm volatile ("btg _LATG, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetInput(void)    { asm volatile ("bset _TRISG, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetOutput(void)   { asm volatile ("bclr _TRISG, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetState(const bool s)  { _LATG14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_Init(const bool d, const bool s) { _LATG14 = s; _TRISG14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_Dispose(void)     { _TRISG14 = 1; _LATG14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG14_GetOpenDrain(void) { return(_ODCG14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetOpenDrain(const bool a) { _ODCG14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG14_GetPullUp(void)   { return(_CNPUG14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetPullUp(const bool a) { _CNPUG14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG14_GetPullDown(void) { return(_CNPUG14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetPullDown(const bool a) { _CNPUG14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetAnalog(void)   { _ANSELG14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetDigital(void)  { _ANSELG14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG14

// Function declarations of port pin RG15
#if defined (_TRISG15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG15_Get(void)         { return((bool)_RG15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_Set(void)         { asm volatile ("bset _LATG, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_Clear(void)       { asm volatile ("bclr _LATG, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_Toggle(void)      { asm volatile ("btg _LATG, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetInput(void)    { asm volatile ("bset _TRISG, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetOutput(void)   { asm volatile ("bclr _TRISG, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetState(const bool s)  { _LATG15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_Init(const bool d, const bool s) { _LATG15 = s; _TRISG15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_Dispose(void)     { _TRISG15 = 1; _LATG15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG15_GetOpenDrain(void) { return(_ODCG15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetOpenDrain(const bool a) { _ODCG15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG15_GetPullUp(void)   { return(_CNPUG15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetPullUp(const bool a) { _CNPUG15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RG15_GetPullDown(void) { return(_CNPUG15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetPullDown(const bool a) { _CNPUG15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELG15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetAnalog(void)   { _ANSELG15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELG15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetDigital(void)  { _ANSELG15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RG15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RG15

// Function declarations of port pin RH0
#if defined (_TRISH0)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH0_Get(void)          { return((bool)_RH0); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_Set(void)          { asm volatile ("bset _LATH, #0 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_Clear(void)        { asm volatile ("bclr _LATH, #0 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_Toggle(void)       { asm volatile ("btg _LATH, #0 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetInput(void)     { asm volatile ("bset _TRISH, #0 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetOutput(void)    { asm volatile ("bclr _TRISH, #0 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetState(const bool s)   { _LATH0 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_Init(const bool d, const bool s) { _LATH0 = s; _TRISH0 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_Dispose(void)      { _TRISH0 = 1; _LATH0 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH0_GetOpenDrain(void) { return(_ODCH0); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetOpenDrain(const bool a) { _ODCH0 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH0_GetPullUp(void)    { return(_CNPUH0); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetPullUp(const bool a)  { _CNPUH0 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH0_GetPullDown(void)  { return(_CNPUH0); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetPullDown(const bool a) { _CNPUH0 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetAnalog(void)    { _ANSELH0 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetDigital(void)   { _ANSELH0 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH0_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH0

