areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RH1
#if defined (_TRISH1)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH1_Get(void)          { return((bool)_RH1); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_Set(void)          { asm volatile ("bset _LATH, #1 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_Clear(void)        { asm volatile ("bclr _LATH, #1 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_Toggle(void)       { asm volatile ("btg _LATH, #1 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetInput(void)     { asm volatile ("bset _TRISH, #1 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetOutput(void)    { asm volatile ("bclr _TRISH, #1 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetState(const bool s)   { _LATH1 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_Init(const bool d, const bool s) { _LATH1 = s; _TRISH1 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_Dispose(void)      { _TRISH1 = 1; _LATH1 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH1_GetOpenDrain(void) { return(_ODCH1); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetOpenDrain(const bool a) { _ODCH1 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH1_GetPullUp(void)    { return(_CNPUH1); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetPullUp(const bool a)  { _CNPUH1 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH1_GetPullDown(void)  { return(_CNPUH1); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetPullDown(const bool a) { _CNPUH1 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetAnalog(void)    { _ANSELH1 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH1)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetDigital(void)   { _ANSELH1 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH1_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH1

// Function declarations of port pin RH2
#if defined (_TRISH2)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH2_Get(void)          { return((bool)_RH2); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_Set(void)          { asm volatile ("bset _LATH, #2 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_Clear(void)        { asm volatile ("bclr _LATH, #2 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_Toggle(void)       { asm volatile ("btg _LATH, #2 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetInput(void)     { asm volatile ("bset _TRISH, #2 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetOutput(void)    { asm volatile ("bclr _TRISH, #2 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetState(const bool s)   { _LATH2 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_Init(const bool d, const bool s) { _LATH2 = s; _TRISH2 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_Dispose(void)      { _TRISH2 = 1; _LATH2 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH2_GetOpenDrain(void) { return(_ODCH2); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetOpenDrain(const bool a) { _ODCH2 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH2_GetPullUp(void)    { return(_CNPUH2); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetPullUp(const bool a)  { _CNPUH2 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH2_GetPullDown(void)  { return(_CNPUH2); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetPullDown(const bool a) { _CNPUH2 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetAnalog(void)    { _ANSELH2 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH2)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetDigital(void)   { _ANSELH2 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH2_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH2

