areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RH3
#if defined (_TRISH3)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH3_Get(void)          { return((bool)_RH3); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_Set(void)          { asm volatile ("bset _LATH, #3 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_Clear(void)        { asm volatile ("bclr _LATH, #3 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_Toggle(void)       { asm volatile ("btg _LATH, #3 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetInput(void)     { asm volatile ("bset _TRISH, #3 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetOutput(void)    { asm volatile ("bclr _TRISH, #3 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetState(const bool s)   { _LATH3 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_Init(const bool d, const bool s) { _LATH3 = s; _TRISH3 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_Dispose(void)      { _TRISH3 = 1; _LATH3 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH3_GetOpenDrain(void) { return(_ODCH3); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetOpenDrain(const bool a) { _ODCH3 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH3_GetPullUp(void)    { return(_CNPUH3); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetPullUp(const bool a)  { _CNPUH3 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH3_GetPullDown(void)  { return(_CNPUH3); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetPullDown(const bool a) { _CNPUH3 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetAnalog(void)    { _ANSELH3 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH3)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetDigital(void)   { _ANSELH3 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH3_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH3

// Function declarations of port pin RH4
#if defined (_TRISH4)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH4_Get(void)          { return((bool)_RH4); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_Set(void)          { asm volatile ("bset _LATH, #4 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_Clear(void)        { asm volatile ("bclr _LATH, #4 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_Toggle(void)       { asm volatile ("btg _LATH, #4 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetInput(void)     { asm volatile ("bset _TRISH, #4 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetOutput(void)    { asm volatile ("bclr _TRISH, #4 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetState(const bool s)   { _LATH4 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_Init(const bool d, const bool s) { _LATH4 = s; _TRISH4 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_Dispose(void)      { _TRISH4 = 1; _LATH4 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH4_GetOpenDrain(void) { return(_ODCH4); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetOpenDrain(const bool a) { _ODCH4 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH4_GetPullUp(void)    { return(_CNPUH4); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetPullUp(const bool a)  { _CNPUH4 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH4_GetPullDown(void)  { return(_CNPUH4); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetPullDown(const bool a) { _CNPUH4 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetAnalog(void)    { _ANSELH4 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH4)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetDigital(void)   { _ANSELH4 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH4_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH4

// Function declarations of port pin RH5
#if defined (_TRISH5)

