areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH5_Get(void)          { return((bool)_RH5); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_Set(void)          { asm volatile ("bset _LATH, #5 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_Clear(void)        { asm volatile ("bclr _LATH, #5 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_Toggle(void)       { asm volatile ("btg _LATH, #5 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetInput(void)     { asm volatile ("bset _TRISH, #5 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetOutput(void)    { asm volatile ("bclr _TRISH, #5 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetState(const bool s)   { _LATH5 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_Init(const bool d, const bool s) { _LATH5 = s; _TRISH5 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_Dispose(void)      { _TRISH5 = 1; _LATH5 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH5_GetOpenDrain(void) { return(_ODCH5); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetOpenDrain(const bool a) { _ODCH5 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH5_GetPullUp(void)    { return(_CNPUH5); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetPullUp(const bool a)  { _CNPUH5 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH5_GetPullDown(void)  { return(_CNPUH5); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetPullDown(const bool a) { _CNPUH5 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetAnalog(void)    { _ANSELH5 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH5)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetDigital(void)   { _ANSELH5 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH5_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH5

// Function declarations of port pin RH6
#if defined (_TRISH6)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH6_Get(void)          { return((bool)_RH6); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_Set(void)          { asm volatile ("bset _LATH, #6 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_Clear(void)        { asm volatile ("bclr _LATH, #6 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_Toggle(void)       { asm volatile ("btg _LATH, #6 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetInput(void)     { asm volatile ("bset _TRISH, #6 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetOutput(void)    { asm volatile ("bclr _TRISH, #6 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetState(const bool s)   { _LATH6 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_Init(const bool d, const bool s) { _LATH6 = s; _TRISH6 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_Dispose(void)      { _TRISH6 = 1; _LATH6 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH6_GetOpenDrain(void) { return(_ODCH6); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetOpenDrain(const bool a) { _ODCH6 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH6_GetPullUp(void)    { return(_CNPUH6); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetPullUp(const bool a)  { _CNPUH6 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH6_GetPullDown(void)  { return(_CNPUH6); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetPullDown(const bool a) { _CNPUH6 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetAnalog(void)    { _ANSELH6 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH6)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetDigital(void)   { _ANSELH6 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH6_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH6

// Function declarations of port pin RH7
#if defined (_TRISH7)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH7_Get(void)          { return((bool)_RH7); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_Set(void)          { asm volatile ("bset _LATH, #7 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_Clear(void)        { asm volatile ("bclr _LATH, #7 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_Toggle(void)       { asm volatile ("btg _LATH, #7 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetInput(void)     { asm volatile ("bset _TRISH, #7 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetOutput(void)    { asm volatile ("bclr _TRISH, #7 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetState(const bool s)   { _LATH7 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_Init(const bool d, const bool s) { _LATH7 = s; _TRISH7 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_Dispose(void)      { _TRISH7 = 1; _LATH7 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH7_GetOpenDrain(void) { return(_ODCH7); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetOpenDrain(const bool a) { _ODCH7 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH7_GetPullUp(void)    { return(_CNPUH7); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetPullUp(const bool a)  { _CNPUH7 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH7_GetPullDown(void)  { return(_CNPUH7); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetPullDown(const bool a) { _CNPUH7 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetAnalog(void)    { _ANSELH7 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH7)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetDigital(void)   { _ANSELH7 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH7_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

