areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RH7

// Function declarations of port pin RH8
#if defined (_TRISH8)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH8_Get(void)          { return((bool)_RH8); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_Set(void)          { asm volatile ("bset _LATH, #8 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_Clear(void)        { asm volatile ("bclr _LATH, #8 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_Toggle(void)       { asm volatile ("btg _LATH, #8 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetInput(void)     { asm volatile ("bset _TRISH, #8 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetOutput(void)    { asm volatile ("bclr _TRISH, #8 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetState(const bool s)   { _LATH8 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_Init(const bool d, const bool s) { _LATH8 = s; _TRISH8 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_Dispose(void)      { _TRISH8 = 1; _LATH8 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH8_GetOpenDrain(void) { return(_ODCH8); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetOpenDrain(const bool a) { _ODCH8 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH8_GetPullUp(void)    { return(_CNPUH8); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetPullUp(const bool a)  { _CNPUH8 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH8_GetPullDown(void)  { return(_CNPUH8); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetPullDown(const bool a) { _CNPUH8 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetAnalog(void)    { _ANSELH8 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH8)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetDigital(void)   { _ANSELH8 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH8_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH8

// Function declarations of port pin RH9
#if defined (_TRISH9)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH9_Get(void)          { return((bool)_RH9); }     ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_Set(void)          { asm volatile ("bset _LATH, #9 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_Clear(void)        { asm volatile ("bclr _LATH, #9 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_Toggle(void)       { asm volatile ("btg _LATH, #9 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetInput(void)     { asm volatile ("bset _TRISH, #9 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetOutput(void)    { asm volatile ("bclr _TRISH, #9 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetState(const bool s)   { _LATH9 = s; }             ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_Init(const bool d, const bool s) { _LATH9 = s; _TRISH9 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_Dispose(void)      { _TRISH9 = 1; _LATH9 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH9_GetOpenDrain(void) { return(_ODCH9); }         ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetOpenDrain(const bool a) { _ODCH9 = a; }           ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH9_GetPullUp(void)    { return(_CNPUH9); }        ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetPullUp(const bool a)  { _CNPUH9 = a; }            ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH9_GetPullDown(void)  { return(_CNPUH9); }        ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetPullDown(const bool a) { _CNPUH9 = a; }           ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetAnalog(void)    { _ANSELH9 = 1; }           ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH9)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetDigital(void)   { _ANSELH9 = 0; }           ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH9_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH9

