areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RH10
#if defined (_TRISH10)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH10_Get(void)         { return((bool)_RH10); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_Set(void)         { asm volatile ("bset _LATH, #10 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_Clear(void)       { asm volatile ("bclr _LATH, #10 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_Toggle(void)      { asm volatile ("btg _LATH, #10 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetInput(void)    { asm volatile ("bset _TRISH, #10 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetOutput(void)   { asm volatile ("bclr _TRISH, #10 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetState(const bool s)  { _LATH10 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_Init(const bool d, const bool s) { _LATH10 = s; _TRISH10 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_Dispose(void)     { _TRISH10 = 1; _LATH10 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH10_GetOpenDrain(void) { return(_ODCH10); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetOpenDrain(const bool a) { _ODCH10 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH10_GetPullUp(void)   { return(_CNPUH10); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetPullUp(const bool a) { _CNPUH10 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH10_GetPullDown(void) { return(_CNPUH10); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetPullDown(const bool a) { _CNPUH10 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetAnalog(void)   { _ANSELH10 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH10)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetDigital(void)  { _ANSELH10 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH10_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH10

// Function declarations of port pin RH11
#if defined (_TRISH11)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH11_Get(void)         { return((bool)_RH11); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_Set(void)         { asm volatile ("bset _LATH, #11 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_Clear(void)       { asm volatile ("bclr _LATH, #11 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_Toggle(void)      { asm volatile ("btg _LATH, #11 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetInput(void)    { asm volatile ("bset _TRISH, #11 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetOutput(void)   { asm volatile ("bclr _TRISH, #11 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetState(const bool s)  { _LATH11 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_Init(const bool d, const bool s) { _LATH11 = s; _TRISH11 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_Dispose(void)     { _TRISH11 = 1; _LATH11 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH11_GetOpenDrain(void) { return(_ODCH11); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetOpenDrain(const bool a) { _ODCH11 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH11_GetPullUp(void)   { return(_CNPUH11); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetPullUp(const bool a) { _CNPUH11 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH11_GetPullDown(void) { return(_CNPUH11); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetPullDown(const bool a) { _CNPUH11 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetAnalog(void)   { _ANSELH11 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH11)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetDigital(void)  { _ANSELH11 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH11_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH11

