areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
// Function declarations of port pin RH12
#if defined (_TRISH12)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH12_Get(void)         { return((bool)_RH12); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_Set(void)         { asm volatile ("bset _LATH, #12 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_Clear(void)       { asm volatile ("bclr _LATH, #12 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_Toggle(void)      { asm volatile ("btg _LATH, #12 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetInput(void)    { asm volatile ("bset _TRISH, #12 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetOutput(void)   { asm volatile ("bclr _TRISH, #12 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetState(const bool s)  { _LATH12 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_Init(const bool d, const bool s) { _LATH12 = s; _TRISH12 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_Dispose(void)     { _TRISH12 = 1; _LATH12 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH12_GetOpenDrain(void) { return(_ODCH12); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetOpenDrain(const bool a) { _ODCH12 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH12_GetPullUp(void)   { return(_CNPUH12); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetPullUp(const bool a) { _CNPUH12 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH12_GetPullDown(void) { return(_CNPUH12); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetPullDown(const bool a) { _CNPUH12 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetAnalog(void)   { _ANSELH12 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH12)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetDigital(void)  { _ANSELH12 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH12_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH12

// Function declarations of port pin RH13
#if defined (_TRISH13)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH13_Get(void)         { return((bool)_RH13); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_Set(void)         { asm volatile ("bset _LATH, #13 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_Clear(void)       { asm volatile ("bclr _LATH, #13 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_Toggle(void)      { asm volatile ("btg _LATH, #13 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetInput(void)    { asm volatile ("bset _TRISH, #13 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetOutput(void)   { asm volatile ("bclr _TRISH, #13 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetState(const bool s)  { _LATH13 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_Init(const bool d, const bool s) { _LATH13 = s; _TRISH13 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_Dispose(void)     { _TRISH13 = 1; _LATH13 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH13_GetOpenDrain(void) { return(_ODCH13); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetOpenDrain(const bool a) { _ODCH13 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH13_GetPullUp(void)   { return(_CNPUH13); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetPullUp(const bool a) { _CNPUH13 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH13_GetPullDown(void) { return(_CNPUH13); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetPullDown(const bool a) { _CNPUH13 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetAnalog(void)   { _ANSELH13 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH13)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetDigital(void)  { _ANSELH13 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH13_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH13

// Function declarations of port pin RH14
#if defined (_TRISH14)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH14_Get(void)         { return((bool)_RH14); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_Set(void)         { asm volatile ("bset _LATH, #14 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_Clear(void)       { asm volatile ("bclr _LATH, #14 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_Toggle(void)      { asm volatile ("btg _LATH, #14 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetInput(void)    { asm volatile ("bset _TRISH, #14 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetOutput(void)   { asm volatile ("bclr _TRISH, #14 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetState(const bool s)  { _LATH14 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_Init(const bool d, const bool s) { _LATH14 = s; _TRISH14 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_Dispose(void)     { _TRISH14 = 1; _LATH14 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH14_GetOpenDrain(void) { return(_ODCH14); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetOpenDrain(const bool a) { _ODCH14 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH14_GetPullUp(void)   { return(_CNPUH14); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetPullUp(const bool a) { _CNPUH14 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH14_GetPullDown(void) { return(_CNPUH14); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetPullDown(const bool a) { _CNPUH14 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetAnalog(void)   { _ANSELH14 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH14)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetDigital(void)  { _ANSELH14 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH14_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

#endif // declarations of pin RH14

// Function declarations of port pin RH15
#if defined (_TRISH15)

static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH15_Get(void)         { return((bool)_RH15); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_Set(void)         { asm volatile ("bset _LATH, #15 \n"); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_Clear(void)       { asm volatile ("bclr _LATH, #15 \n"); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_Toggle(void)      { asm volatile ("btg _LATH, #15 \n"); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetInput(void)    { asm volatile ("bset _TRISH, #15 \n"); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetOutput(void)   { asm volatile ("bclr _TRISH, #15 \n"); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetState(const bool s)  { _LATH15 = s; }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_Init(const bool d, const bool s) { _LATH15 = s; _TRISH15 = d; } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_Dispose(void)     { _TRISH15 = 1; _LATH15 = 1; } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH15_GetOpenDrain(void) { return(_ODCH15); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetOpenDrain(const bool a) { _ODCH15 = a; }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH15_GetPullUp(void)   { return(_CNPUH15); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetPullUp(const bool a) { _CNPUH15 = a; }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RH15_GetPullDown(void) { return(_CNPUH15); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetPullDown(const bool a) { _CNPUH15 = a; }         ///< Sets the connection state of the pin's pull down resistor
#if defined (_ANSELH15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetAnalog(void)   { _ANSELH15 = 1; }          ///< Enable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetAnalog(void)   { Nop(); }                  ///< Function not available at this pin
#endif
#if defined (_ANSELH15)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetDigital(void)  { _ANSELH15 = 0; }          ///< Disable analog functions of this pin
#else
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RH15_SetDigital(void)  { Nop(); }                  ///< Function not available at this pin
#endif

