areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c_pin_intrinsics.h
#endif // declarations of pin RH15

// Virtual device pin functions of pins, which have not been routed to package pins
#if defined (P33C_VP_COUNT)

// Declaration of an internal (virtual) pin, which is not available as common device pin
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RVX_Get(void)          { return(0); }    ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_Set(void)          { Nop(); } ///< Sets the most recent pin state to logic HIGH
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_Clear(void)        { Nop(); } ///< Sets the most recent pin state to logic LOW
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_Toggle(void)       { Nop(); } ///< Toggles the most recent pin state
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetInput(void)     { Nop(); } ///< Sets the pin direction to high impedance input (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetOutput(void)    { Nop(); } ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetState(const bool s)  { Nop(); }            ///< Sets the pin direction to low impedance output (no state change)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_Init(const bool d, const bool s) { Nop(); } ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_Dispose(void)      { Nop(); } ///< Sets the pin to high impedance input (RESET default)
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RVX_GetOpenDrain(void) { return(0); }       ///< Gets the pin open drain mode
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetOpenDrain(const bool a) { Nop(); }         ///< Sets the pin open drain mode
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RVX_GetPullUp(void)    { return(0); }       ///< Gets the connection state of the pin's pull up resistor 
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetPullUp(const bool a) { Nop(); }           ///< Sets the connection state of the pin's pull up resistor
static inline bool __attribute__ ((section (".intrinsics"))) __builtin_RVX_GetPullDown(void)  { return(0); }       ///< Gets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetPullDown(const bool a) { Nop(); }         ///< Sets the connection state of the pin's pull down resistor
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetAnalog(void)    { Nop(); }                  ///< Function not available at this pin
static inline void __attribute__ ((section (".intrinsics"))) __builtin_RVX_SetDigital(void)   { Nop(); }                  ///< Function not available at this pin

#endif // end of P33C_VP_COUNT

#endif  /* P33C_PIN_INTRINSICS_H */

// __________________________________
// end of file

